[
    {
        "Title": "TBS Dumbbell Romanian Deadlift",
        "Desc": "The dumbbell stiff-legged deadlift targets the hamstrings, glutes, low and upper back, as well as the core. The purpose of the stiff-legged, as opposed to Romanian deadlift with slightly bent knees, is to engage the hamstrings and low back to an even greater degree.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Paul Carter Incline Bench Press",
        "Desc": "The incline bench press is an upper body compound movement that targets the upper chest.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Standing hip extension",
        "Desc": "The standing hip extension is a movement that activates the glutes and hamstrings. It is often performed either for time or reps as part of a dynamic warm-up.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Paul Carter Leg Extension",
        "Desc": "The leg extension is an isolation exercise for the quads.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Barbell spider curl",
        "Desc": "The barbell spider curl is an exercise targeting the biceps and performed face down on either an incline bench or on the flat side of a preacher bench. The vertical bench angle helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Single-arm triceps kick-back",
        "Desc": "The single-arm triceps kick-back is a popular movement to increase size and strength of the triceps. It is usually performed for moderate to high reps, at least 8-12 reps, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "One-Arm Long Bar Row",
        "Desc": "The single-arm landmine bent-over row is a barbell exercise focused on the muscles of the middle back, such as the lats (latissimus dorsi) and rhomboids. It also targets the biceps and grip. It utilizes a landmine device which anchors one end of the barbell near the ground, but could also be approximated by placing the barbell in the corner of a room.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Standing cable leg curl",
        "Desc": "The standing cable leg curl is an isolation exercise for the hamstrings. It is often used as a variation of leg curl machines and for working each side independently. It is usually performed for moderate to high reps, at least 8-12 reps per set, as part of lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Jump to pull-up",
        "Desc": "The jump to pull-up is a bodyweight exercise that targets the muscles of the back, biceps, and, to a lesser degree, legs. It involves jumping up to a pull-up bar between reps. Similar to a push-press, the legs help power through the most difficult portion of the pull-up, allowing you to perform more reps. Jumping pull-ups are often performed for moderate to high reps, such as 8-12 reps per set or more, as an accessory to other pulling or pull-up training, or as a full-body movement in a circuit or metcon.",
        "BodyPart": "Lats"
    },
    {
        "Title": "FYR Bent-Over Dumbbell Row",
        "Desc": "The dumbbell bent-over row is a popular exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lat), lower trapezius, and rear deltoids. It can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Single-Leg Press",
        "Desc": "The single-leg leg press is an exercise targeting the quadriceps one leg at a time. Many lifters prefer the leg press to squatting for several reasons, including the perception that it’s safer for the spine.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Lying cable front raise",
        "Desc": "The lying cable front raise is an isolation exercise for the shoulders, particularly the front deltoids. It is performed lying on the back, either on a bench or the ground, with the cable lifted over the torso. This movement is usually performed for moderate to high reps for a burn and pump as part of a shoulder-focused workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Smith Machine Incline Bench Press",
        "Desc": "The Smith machine incline bench press is a machine-based movement targeting the chest, particularly the upper chest. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest or upper-body focused workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Weighted back extension",
        "Desc": "The weighted back extension is an exercise targeting the spinal erectors, as well as the glutes and hamstrings. Back extensions are often done for high reps without weight, but when done with weight, they can be an excellent accessory movement for deadlift strength as well as an overall posterior-chain strength builder. Because your back is the limiting factor, it's still an exercise that is usually done for moderate to high reps, such as 8-12 reps per set or higher. You can weight it with a plate or by holding a dumbbell or other weight in your hands.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Single-leg lying leg curl",
        "Desc": "The single-leg lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training. Performing it one leg a time allows you to focus on the mind-muscle connection of each leg and address muscle imbalances.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Behind-the-head skullcrusher",
        "Desc": "The behind-the-head skullcrusher is a variation on a triceps exercise that has been a staple of bodybuilders for decades. In this version, instead of the bar coming down lightly to the forehead, the bar tracks over the top of the head without touching it. Skullcrushers are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout. If a straight bar is uncomfortable for your wrists or elbows, try using an angled EZ-bar.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Incline band bench press",
        "Desc": "The incline band bench press is variation of the incline press, a popular upper-body exercise targeting the upper pectoral muscles. While it can be a strength-focused movement, it is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Paul Carter Cable Cross-Over",
        "Desc": "The cable cross-over is an isolation movement that uses a cable stack to build bigger and stronger pectoral muscles. Since it's done using adjustable pulleys, you can target different parts of your chest by setting the pulleys at different levels. It is common in upper body and chest-focused muscle-building workouts, often as a pre-exhaust at the beginning of a workout, or a finishing movement at the end. It is often in combination with other presses or flyes to target the chest from different angles.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Lying cable triceps extension",
        "Desc": "The lying cable triceps extension is an isolation exercise performed lying on either a bench or the floor. This movement is usually performed for moderate to high reps for a burn and pump as part of an arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Seated Machine Row - Gethin Variation",
        "Desc": "The machine seated row is an exercise targeting the back muscles, emphasizing the mid- to upper-back.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Toe-touch",
        "Desc": "The toe-touch is a bodyweight movement that targets the muscles of the abs, the rectus abdominis or \"six-pack\" muscles in particular. It can be performed for time or reps in the ab-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Straight-arm plank with kick-back",
        "Desc": "The straight-arm plank with kick-back is a hybrid movement that trains the abdominal and triceps muscles simultaneously. It can address multiple muscle groups in a time-efficient muscle-building or circuit-style workout, while also providing an additional cardiovascular challenge.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Standing lat pull-down",
        "Desc": "The standing lat pull-down is a variation of the lat pull-down performed standing next to a cable stack rather than sitting on a bench or machine. It has all of the same benefits of a lat pull-down performed on a bench or machine, in addition to providing further activation to the core and lower body. If you are too tall to perform this movement, a kneeling lat pull-down provides all of the same benefits.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "High Cable Curls",
        "Desc": "The lying high-cable biceps curl is a single-joint exercise targeting the biceps in a prone (face-up) position. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "AM Seated Hammer Curls",
        "Desc": "The seated hammer curl is a popular exercise for building bigger biceps. The movement resembles hammering a nail—hence the name. While hammer can be performed standing, this version involves sitting on a bench.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Decline Dumbbell Flyes",
        "Desc": "The decline dumbbell chest fly is an upper body isolation exercise targeting the lower chest. It will require less weight than a decline press, which makes it a great hypertrophy exercise with high reps.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Dumbbell stiff-legged deadlift",
        "Desc": "The dumbbell stiff-legged deadlift is a dumbbell exercise that targets the hamstrings, glutes, lower and upper back, and core. The difference between a stiff-legged deadlift and a Romanian deadlift is primarily the amount of knee bend. The knees are only slightly bent in a stiff-legged deadlift, while they bend more in a Romanian deadlift. Stiff-legged deadlifts are generally performed for low to moderate reps, such as 8-10 reps per set, with a focus on maximizing the hamstring stretch rather than moving heavy weight. Feel free to wear a weight belt to protect your lower back.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "BFR overhand straight-bar push-down",
        "Desc": "The blood flow restriction (BFR) overhand straight-bar push-down is an arm movement that builds triceps size and strength using a cable stack, straight-bar grip, and blood flow restriction bands. It is popular in high-rep \"pump\"-style arm workouts. The bands should be placed as high as possible on your arms, at a tightness of no greater than 8 on a scale of 10. Most BFR workouts recommend using a far lighter weight than usual, perhaps as low as 25-50 percent of a normal working weight.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Plank up-down",
        "Desc": "The plank up-down is a variation of the plank push-up that ends in an elbow plank rather than with the chest on the ground. It involves transitioning between the two positions one arm at a time, rather than two. It puts more stress on the triceps and core than traditional planks. It can be performed for time or reps in any bodyweight workout or during the core-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Band-suspended kettlebell bench press",
        "Desc": "The band-suspended kettlebell bench press is a bench press variation where kettlebells or weight plates are hung from the ends of a barbell by looped bands. The suspended weights can be in addition to normally loaded weight plates, or in the place of them. Because the instability of the weights makes the lift difficult, this bench press variety is a popular accessory movement for building the traditional bench press in powerlifting training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Pullups",
        "Desc": "The pull-up is a multi-joint bodyweight exercise that builds strength and muscle in the upper back, biceps, and core. It is often used as a measurement tool in military or tactical fitness tests, and is an excellent gauge of “relative strength” which is strength in relation to bodyweight.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Standing Cable Curl - Gethin Variation",
        "Desc": "The cable straight-bar biceps curl takes a classic bodybuilding exercise, the standing barbell curl, and replaces the barbell with a handle attached to a cable. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Alternate Incline Dumbbell Curl",
        "Desc": "The alternating incline dumbbell biceps curl is an exercise targeting the biceps and performed face up on an incline bench. This creates a vertical arm angle which helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 rep per arm or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Deadlift - Gethin Variation",
        "Desc": "The barbell deadlift is a compound exercise used to develop overall strength and size in the posterior chain. It is a competition lift in the sport of powerlifting, but is also considered a classic benchmark of overall strength. When performed with the hands outside the knees, it is often called a \"conventional\" deadlift. When the feet are wide and the hands are inside the knees, it is a sumo deadlift.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Alternating dumbbell snatch",
        "Desc": "The alternating dumbbell snatch is an explosive exercise that builds full-body power and targets the muscles of the hips, back, and shoulders. Performing it by alternating arms gives each arm the chance to recover, allowing you to do a greater amount of quality work. It can be performed for low reps with a focus on power and speed, or for higher reps to build muscle or as part of a metabolic conditioning circuit.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Dumbbell overhead hold with single-arm curl",
        "Desc": "The dumbbell overhead hold with single-arm curl combines an isometric overhead hold with a curl for the other arm. The two movements collectively target the muscles of the shoulders and arms, while providing a surprising core challenge. Expect to be challenged, even with light weight.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Dumbbell V-Sit Cross Jab",
        "Desc": "The dumbbell V-sit cross jab is a hybrid movement that trains the abdominal and shoulder muscles simultaneously. It can address multiple muscle groups in a time-efficient muscle-building or circuit-style workout, while also providing a cardiovascular challenge.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Face-down incline dumbbell biceps curl",
        "Desc": "The face-down incline dumbbell biceps curl is an exercise targeting the biceps and performed face down on an incline bench. This creates a vertical arm angle, which helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "EZ-bar spider curl",
        "Desc": "The EZ-bar spider curl is an exercise targeting the biceps and performed face down on either an incline bench or on the flat side of a preacher bench. The EZ-bar makes for a more comfortable wrist position, while the angle helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Pendlay Row",
        "Desc": "The Pendlay row, named after the well-known strength coach Glenn Pendlay, is a bent-over row variation where each rep starts with the barbell resting on the ground. This eliminates the stretch reflex and forces the lifter to pull with power and a bent-over spine. The Pendlay row can be performed heavy for low reps, but is usually performed for moderate reps, such as 5-8 per set.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Seated Cable Rows",
        "Desc": "The cable seated row is a popular exercise to train the muscles of the upper back, including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, using a cable stack. It also targets the biceps to a lesser degree. The cable row can work well in a variety of rep-ranges, but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Lying Leg Curls",
        "Desc": "The lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Side-lying leg lift",
        "Desc": "The side-lying leg lift is a bodyweight exercise targeting the muscles of the hips and glutes. It can be a worthy addition to a dynamic warm-up on a lower-body or strength-focused training day, a component of a lower-body circuit or workout, or a glute activation drill to do anytime. Generally, leg lifts are done for high reps, such as 8-15 reps per leg or more.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "UP Deficit Kettlebell Stiff-Legged Deadlift",
        "Desc": "The kettlebell deficit deadlift is a more advanced version of the kettlebell deadlift movement that is performed standing on steps or boxes. It can be done to build strength or hip mobility for squats or deadlifts, in high reps or in more traditional strength and muscle-focused rep ranges.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Straight-arm cable pull-over",
        "Desc": "The straight-arm cable pull-over is an exercise that focuses on the muscles of the lats (latissimus dorsi) and chest using a cable stack and a flat bench. It is most commonly used for higher reps, such as 10-15 or more, in muscle-building workouts. It is also an effective substitute for dumbbell pull-overs or a pull-over machine, if you don't have access to them or they aggravate your shoulders.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Lat pull-down",
        "Desc": "The lat pull-down is a cable-based exercise that's ubiquitous in gyms around the world. This back builder is easy to learn and highly effective at building back size and strength. It's usually trained in moderate to high reps, such as 8-12 reps per set. If grip strength is a limitation, you can wear wrist straps.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Smith machine stiff-legged deadlift",
        "Desc": "The Smith machine stiff-legged deadlift is a machine-based exercise targeting the muscles of the hamstrings, glutes, and upper back. The Smith machine mimics a barbell but provides more stability. This movement can be programmed like a traditional stiff-legged or Romanian deadlift, in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a full-body or lower-body workout.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Narrow-stance hack squat",
        "Desc": "The narrow-stance hack squat is a machine-based exercise that targets the muscles of the legs, particularly the quadriceps. It is often used as an accessory for squats, or as a muscle-building movement during lower-body training, and is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Incline straight-arm pull-over",
        "Desc": "The incline straight-arm pull-over is an upper-body exercise targeting the chest and lats (latissimus dorsi). Performing it on an incline bench emphasizes the stretch on the chest in particular. If this movement causes pain in the front of the shoulders, perform it with a more limited range of motion or try pull-overs using a high cable stack instead. Pull-over variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of chest or back-focused upper-body training.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Cable reverse crunch",
        "Desc": "The cable reverse crunch is performed on the ground facing away from a high pulley, which helps target the lower abdominals specifically.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Rhomboids SMR",
        "Desc": "Rhomboids self-myofascial release (SMR) is a self-administered soft-tissue treatment for the upper body, usually using a foam roller, lacrosse ball, or other \"trigger point\" massage tool. By applying pressure strategically to the rhomboid muscles of the mid back, some people find they can cause this often painful and tight area to relax or \"release.\" Rhomboids SMR is often accompanied by SMR on the lats, or by stretches that target the rhomboids or lats.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Negative pull-up",
        "Desc": "The negative pull-up is a multijoint bodyweight exercise that focuses on just one half of the traditional pull-up: the lowering, eccentric, or \"negative\" portion. Because muscles are stronger eccentrically than they are concentrically, many people can perform negatives even if they can't perform full pull-ups. For this reason, it is a popular training tool to help people earn their first pull-up rep, or as a back-off exercise after doing full pull-ups.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Tricep Dumbbell Kickback",
        "Desc": "The single-arm triceps kick-back is an isolation move from a bent-over position used to increase size and strength of the triceps.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Dumbbell front squat",
        "Desc": "The dumbbell front squat is a popular exercise for targeting the muscles of the lower body, including the quadriceps, glutes, and hamstrings. Holding dumbbells in the racked position also works the core and upper-back muscles to maintain posture while the lower body moves. Because the amount of weight you can use will be limited by what you can clean to the rack position, this movement is usually performed for moderate to high reps, at least 8-12 reps per set or more. If this movement hurts your knees, try performing it with a wider stance.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Straight-Arm Pulldown",
        "Desc": "The straight-arm bar pull-down is a variation of the straight-arm lat pull-down performed using a cable stack machine. It can either be performed in an athletic upright stance, or slightly bent-over. It both stretches and contracts the muscles of the lats (latissimus dorsi) as well as providing additional activation to the other upper back muscles and the core. Because the triceps are also isometrically involved in the movement, it is usually performed for higher reps, like 8-15 reps or above.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Reverse-grip cable straight-bar push-down",
        "Desc": "The reverse-grip cable straight-bar push-down is a twist on the popular cable straight-bar push-down. The difference has to do with how the hands are positioned holding the bar: the palms facing up rather than down. Because grip will be a limiting factor, this movement is usually performed for moderate to high reps, such as 8-12 reps per set or higher.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Bodyweight squat",
        "Desc": "The bodyweight squat is a fundamental exercise that strengthens the quads, glutes, and hamstrings. It can be performed as part of a dynamic warm-up, for time or reps during a workout, or for hip and spine mobility any time.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Lying groin stretch with band",
        "Desc": "The lying groin stretch with band is a simple way to stretch a chronically tight muscle group of the lower body. It is common in stretching and yoga classes but can also be performed individually as part of a warm-up, paired with movements in a workout, or as part of a cool-down or recovery strategy.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Shoulder L",
        "Desc": "The bent-over shoulder rotation is an upper-body exercise that helps strengthen the muscles around the rotator cuff for a stable shoulder joint. It is usually performed as part of a dynamic warm-up for the shoulders. It can be performed with body weight, light dumbbells or weight plates, or bands.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell deficit deadlift",
        "Desc": "The barbell deficit deadlift is a compound exercise targeting the posterior chain. It is commonly utilized in powerlifting training to build pulling strength off the floor, but is also an effective muscle-building movement for the glutes and hamstrings. It is usually performed with lighter weight, and perhaps for higher reps, than traditional deadlifts. If these make your back sore, decrease the deficit and/or wear a weightlifting belt.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Hollow-body knee tuck",
        "Desc": "The hollow-body knee tuck is a bodyweight abdominal exercise performed on the floor. It is similar to both the hollow-body hold and the knee tuck or reverse crunch, combining elements of both. It primarily targets the muscles of the rectus abdominis, or “six-pack” muscles. It can be performed for reps or time, either as part of an ab-focused workout or as a component of a circuit workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Incline dumbbell chest fly",
        "Desc": "The incline dumbbell chest fly is an upper-body exercise targeting the chest. Performing it at an incline helps to target the upper chest in particular, while limiting involvement of the shoulders. Fly variations are usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Total Fitness Bear Crawl",
        "Desc": "The bear crawl is a popular bodyweight crawling exercise. While it looks simple, the bear crawl is an intense full-body movement that targets the cardiovascular system as well as a wide range of muscle groups, the shoulders, core, and legs in particular. It can be done as a full-body warm-up, in short bursts for power or circuit training, or for longer durations as cardiovascular conditioning.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Weighted pull-up",
        "Desc": "The weighted pull-up is a more advanced variation of the pull-up exercise in which the lifter adds extra weight to their body. Options for adding weight include a dip belt, weighted vest, chains, a dumbbell placed between the feet or legs, or looping a kettlebell over the foot. Like other pull-up variations, the weighted pull-up builds strength and muscle in the upper back, biceps, and core.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Incline Dumbbell Row - Gethin Variation",
        "Desc": "The incline dumbbell row is an upper body isolation exercise targeting the lower lats and upper back muscles.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Total Fitness Skip",
        "Desc": "The skip is an exercise that builds power and explosiveness in the legs. It's commonly performed by children and in gym classes, but is also great for working the legs and hip flexors, making it a favorite warm-up for athletes who need to explode vertically.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Decline EZ-bar skullcrusher",
        "Desc": "The decline EZ-bar skullcrusher is a popular exercise targeting the triceps muscles. The angle of the bench creates a greater range of motion than flat bench skullcrushers, as well as targeting the lateral head of the muscle. This exercise is usually performed for moderate to high reps as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Kettlebell upright row and press",
        "Desc": "The kettlebell upright row and press is a combination of two popular kettlebell movements in a single sequence. This combination can be performed for time or for reps, often as circuit-style training for conditioning or fat loss, or in a kettlebell complex or flow.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell step-down reverse lunge",
        "Desc": "The barbell step-down reverse lunge is an exercise targeting the lower body, particularly the glutes and hamstrings. The front foot is slightly elevated during this movement, making the subsequent step-down more pronounced and difficult. These are usually performed for time or for relatively high reps, such as 10 reps or more per set.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Leg curl",
        "Desc": "The leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It comes in seated and lying varieties, but the seated leg curl machine is more common in commercial gyms. Leg curl variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "TBS Skullcrusher",
        "Desc": "The EZ-bar skullcrusher is a popular exercise targeting the triceps muscles. The EZ-bar is used more often than a straight bar. As for the name, that’s worst-case scenario. The bar should actually come down behind the head. It is usually performed for moderate to high reps as part of an upper body or arms-focused workout. No need to chase a 1RM on this move!",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Partner Superman with alternating high-five",
        "Desc": "The partner Superman with alternating high-five is an exercise in which both partners perform isometric holds for reps, high-fiving each other in between. It targets the muscles of the posterior chain, including the muscles of the glutes, spinal erectors, and upper back. It can be performed as part of a dynamic warm-up, or as part of a core or back-focused workout or finisher.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Leverage High Row",
        "Desc": "The machine high row is an exercise targeting the lats and works the back overall.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Groiner",
        "Desc": "The groiner is an explosive bodyweight exercise targeting the legs, shoulders, and core. It also includes a dynamic stretch of the hips. It can be performed for time or reps in any fat-loss or athleticism-focused circuit or workout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Standing cable high-to-low twist",
        "Desc": "The standing cable high-to-low twist is a core exercise targeting the lower abdominals and the obliques. Take care to perform it with control, as opposed to violent twisting which can injure the back. It is usually performed for moderate to high reps, at least 8-15 per side, as part of the core-focused portion of a workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Straight-Arm Dumbbell Pull-Over - Gethin Variation",
        "Desc": "The straight-arm dumbbell pull-overpull-over was a staple exercise of the Golden Era of bodybuilding and a favorite of Arnold Schwarzenegger himself. Done properly, the exercise hits the bottom of the pecs, the lats, the abs, and the triceps.",
        "BodyPart": "Lats"
    },
    {
        "Title": "TBS Inverted Row",
        "Desc": "The Smith machine inverted row is a bodyweight exercise targeting the muscles of the lats (latissimus dorsi) and upper back, using the bar of the Smith machine to hang and pull from. You can change the bar height to customize the difficulty level and desired angle of the row. This variation is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Sissy squat",
        "Desc": "The sissy squat is a bodyweight squat variation that involves letting the knees travel far over the toes, placing an extreme stretch on the quads. This movement targets the quad muscles directly and can be performed in partial or full ranges of motion based on knee health and pain.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm dumbbell front squat",
        "Desc": "The single-arm dumbbell front squat is an exercise that targets the quads, glutes, and hamstrings, as well as the upper body. It also challenges oblique strength due to the offset loading. It can be performed in strength and muscle-focused workouts, in circuit training, or as part of a larger dumbbell complex with movements like single-arm dumbbell clean and presses.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Exercise ball bird dog",
        "Desc": "The exercise ball bird dog is a dynamic movement focusing on the glutes and the postural muscles of the upper back. When performing it, use an exercise ball that is tall enough to support your chest and core, but short enough to allow your hands and knees to reach the ground. It is slightly easier than a bodyweight bird dog and can work as a regression for that movement. It can be done for time or reps as part of a warm-up, paired with movements in a workout, or as a mobility or recovery exercise.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Lying quad stretch with band",
        "Desc": "The lying quad stretch with band is a simple way to stretch a chronically tight muscle group of the lower body. It is common in stretching and yoga classes but can also be performed individually as part of a warm-up, paired with movements in a workout, or as part of a cool-down or recovery strategy.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Banded Hammer Press - Gethin Variation",
        "Desc": "The machine chest press is an upper body exercise targeting the pectoral muscles.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Cross-over push-up",
        "Desc": "The cross-over push-up is a variation of the push-up that adds a degree of difficulty by stepping over a small box or step between repetitions. It can be performed for time or for reps and creates a greater core stabilization challenge by forcing the core muscles to maintain the a neutral spine throughout the movement.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Shoulder T",
        "Desc": "The bent-over plate rear delt raise is an exercise targeting the rear heads of the shoulders, aka deltoids. You can also use dumbbells or other light weights for a similar effect. This movement is usually performed as part of a dynamic warm-up, or as a high-rep burnout movement on a shoulder or back day.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell seal row",
        "Desc": "The barbell seal row is a weighted exercise targeting the muscles of the middle back, including the lats (latissimus dorsi) and rhomboids. It can be performed on a special elevated bench, on a bench placed on top of boxes or benches, or on a bench with a slight incline. The higher the bench, the greater the range of motion and stretch at the bottom of the movement. It is usually performed as an assistance movement for back strength and muscle growth, in rep ranges of 8-12 reps per set or higher.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Dumbbell racked carry",
        "Desc": "The dumbbell racked carry involves carrying dumbbells for time or distance, while holding them close to the shoulders in a front-racked position. Similar to a dumbbell farmer's carry, it can be a challenging finisher to any workout, or work well in fat-loss circuit training or as an accessory movement to heavy lifts like the deadlift.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Kneeling cable triceps extension",
        "Desc": "The kneeling cable triceps extension is a single-joint exercise meant to isolate the triceps muscles using a high pully on a cable stack and a bench. It can also be performed in a tall-kneeling stance from a low pully. It is most commonly used in muscle-building triceps or arm workouts.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "UP Lat Pull-Down",
        "Desc": "The lat pull-down is a cable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Cable EZ-Bar Preacher Curl - Gethin Variation",
        "Desc": "The cable preacher curl is a single-joint arm exercise that builds strength and size in the biceps using a cable stack and a preacher bench. It is popular in muscle-building arm workouts because the angle of the bench effectively removes the shoulders from the movement, largely isolating the biceps. It is generally performed for higher reps, at least 8-15 per set.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Parallel bars leg raise",
        "Desc": "The parallel bars leg raise is a bodyweight exercise that targets the abs. It is performed on parallel bars, starting in the top position of a dip. Leg raises are often performed for moderate to high reps, such as 8-12 reps or more, as part of ab-focused training. However, this difficult variation may require some time to build up to those rep ranges.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Reverse-grip hands-elevated push-up",
        "Desc": "The reverse-grip hands-elevated push-up is a bodyweight exercise performed on a Smith machine or other elevated surface. It targets the chest, triceps, and shoulders. It can work as a regression of floor reverse-grip push-ups, or in a progressive mechanical dropset moving the bar up once you reach failure at a lower height.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Single-arm cable biceps curl",
        "Desc": "The single-arm cable biceps curl is a single-joint isolation exercise for building the biceps. This move is intended to be strict and deliberate; this is not an exercise for using momentum or otherwise cheating. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Kettlebell bent-over row to clean",
        "Desc": "The kettlebell bent-over row to clean is a combination kettlebell exercise that targets many of the muscles of the upper body including the lats (latissimus dorsi), biceps, shoulders, and core. It also strengthens and trains power output of the lower body. It can be done for reps or for time as a strength or muscle-focused complex, or in circuit-style training for conditioning or fat loss.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Band-assisted pull-up",
        "Desc": "The band-assisted pull-up is a variation of the pull-up exercise in which the reps are performed with an elastic band looped around the feet or knees. This reduces weight and resistance at the bottom of the rep, while increasing it toward the top. Like other pull-up variations, it builds strength and muscle in the upper back, biceps, and core, and is often used as a way to help people boost their pull-up numbers or perform their first rep.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Reverse-grip lat pull-down",
        "Desc": "The reverse-grip lat pull-down is variation on the lat pull-down that targets the lower lats more than an overhand grip. Because the hands are relatively close together, it also increases the range of motion beyond wider-grip pull-down variations. It can be performed for low reps, such as 5-6 per set, for back strength, or for higher reps for size.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Kettlebell plyo push-up",
        "Desc": "The kettlebell plyo push-up is an explosive upper-body movement that uses a kettlebell primarily as a platform for the hands. A short step, dumbbell, or other stationary object could also be used in place of the kettlebell. It can be performed for reps or time, either for low reps to build explosive power or for higher reps for conditioning.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Barbell hip thrust-",
        "Desc": "The barbell hip thrust is a popular exercise that targets the posterior chain, particularly the glutes and hamstrings. It involves fully extending your hips while holding a weighted barbell across the front of the hips. It is a great movement to activate the glutes prior to other lower-body training, but can also be performed in the main part of a workout, or for high reps as a glute burnout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Single-arm stiff-legged deadlift",
        "Desc": "The single-arm stiff-legged deadlift is a dumbbell exercise that targets the hamstrings, glutes, lower and upper back, and core. The difference between a stiff-legged deadlift and a Romanian deadlift is primarily the amount of knee bend. The knees are only slightly bent in a stiff-legged deadlift, while they bend more in a Romanian deadlift. Stiff-legged deadlifts are generally performed for low to moderate reps, such as 8-10 reps per set, with a focus on maximizing the hamstring stretch rather than moving heavy weight. Feel free to wear a weight belt to protect your lower back.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Side plank lateral raise",
        "Desc": "The side plank lateral raise is an exercise that combines an isometric side plank hold with a dumbbell raise to target both the core and the shoulders. You probably won't be able to use much weight without disrupting your balance, but even at light weight, this is a movement that can help address multiple muscle groups in a time-efficient workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Machine Triceps Extension",
        "Desc": "The machine triceps extension is an isolation exercise targeting the tricep muscles.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Glute bridge",
        "Desc": "The glute bridge is a popular lower-body bodyweight exercise that primarily targets the glutes, but also activates the lower back and hamstrings. It can be performed with body weight alone, or with added resistance such as barbells, dumbbells, or bands. It can be performed for time or reps and works perfectly in a dynamic warm-up for lower-body training, but can also be performed for glute activation anytime.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Yoga plex",
        "Desc": "The yoga plex is a stretch that combines elements of the downward facing dog yoga pose with the “world’s greatest stretch.” It is most commonly performed as part of a dynamic warm-up, to limber up muscles from head to toe, raise the body’s core temperature, and mobilize the hips, upper back, and shoulders.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Seated alternating biceps curl",
        "Desc": "The seated alternating biceps curl is an exercise that builds bigger and stronger biceps. The alternating technique allows one arm to rest briefly while the other arm lifts. It is usually performed for moderate to high reps, such as 8-12 reps or more, as part of the upper-body or arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Rope climb",
        "Desc": "The rope climb is an exercise that is used commonly in CrossFit workouts and as a test of upper-body strength. It was even contested at the Olympics in the early 20th century. It targets a wide range of upper-body musculature, including the hands and forearms, shoulders, biceps, lats (latissimus dorsi), and core.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Bench skip",
        "Desc": "The bench skip is an explosive lower-body exercise that involves alternating the position of the feet on top of a bench. It primarily targets the muscles of the lower body, but is also a serious cardiovascular challenge. It is often performed for high reps or for time as part of a fat-loss or athleticism-focused workout or circuit.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Dumbbell pull-over to skullcrusher",
        "Desc": "The dumbbell pull-over to skullcrusher is a complex that combines two popular exercises into one sequence that works much of the upper body, particularly the chest, triceps, and serratus anterior muscles. Because the pull-over will determine the amount of weight you can use, this movement is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body portion of a workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Single-arm kneeling lat pull-down",
        "Desc": "The single-arm kneeling lat pull-down is a variation of the lat pull-down exercise performed one arm at a time, with the knees on the ground, rather than sitting on a bench or machine. It has all of the same benefits of a lat pull-down performed on a bench or machine, in addition to providing further activation to the core and lower body.",
        "BodyPart": "Lats"
    },
    {
        "Title": "AM Flat Bench Barbell Press",
        "Desc": "The bench press is a compound exercise that builds strength and muscle in the chest and triceps. When many people think of listing, the bench press is often the first exercise that comes to mind",
        "BodyPart": "Chest"
    },
    {
        "Title": "Close-Grip Front Lat Pulldown",
        "Desc": "The close-grip pull-down is a variation on the lat pull-down, acable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Single-arm cable seated row",
        "Desc": "The single-arm cable seated row is a version of the cable row movement that trains the muscles of the upper back one side at a time. It targets a wide range of muscles including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids. It also targets the biceps to a lesser degree. The single-arm row can work well in a variety of rep ranges but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "UP Single-Leg Press",
        "Desc": "The single-leg leg press is an exercise targeting the quadriceps one leg at a time. Many lifters prefer the leg press to squatting for several reasons, including the perception that it’s safer for the spine.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Machine seated row",
        "Desc": "The machine seated row is a popular exercise targeting the back muscles, particularly the lats (latissimus dorsi), rhomboids, and middle and lower trapezius. There is a wide variety of seated row machines, but most of them approximate the motion of a free-weight row, but in an upright, forward-facing position. Machine row variations are often performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or back-focused portion of a workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Landmine squat",
        "Desc": "The landmine squat is a lower-body exercise that uses an angled barbell anchored at floor level in a landmine device. It can also be performed by sticking a barbell in the corner of a room, preferably in a towel to protect the walls. The landmine squat is similar in many ways to a goblet squat, but with slight differences due to the angle of the barbell. It can be trained in traditional muscle and strength-focused rep ranges or for higher reps.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Bar Push-Up Smith Machine",
        "Desc": "The hands-elevated push-up is a variation on the push-up, a body-weight standard. The hands are elevated, so that your body is aligned at an angle to the floor rather than parallel.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Straight-Arm Pull-Down - Gethin Variation",
        "Desc": "The straight-arm bar pull-down is a variation of the straight-arm lat pull-down performed using a cable stack machine. It can either be performed in an athletic upright stance, or slightly bent-over. It both stretches and contracts the muscles of the lats (latissimus dorsi) as well as providing additional activation to the other upper back muscles and the core. Because the triceps are also isometrically involved in the movement, it is usually performed for higher reps, like 8-15 reps or above.",
        "BodyPart": "Lats"
    },
    {
        "Title": "King Maker Dumbbell Lateral Raise",
        "Desc": "The dumbbell lateral raise is an upper body isolation exercise for building shoulder strength and muscle. It's a staple strength training move and is a great option for accessory work on upper body training days. This exercise particularly focuses on the lateral or medial head of the deltoid, making them appear wider and more developed.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Seated cable deadlift",
        "Desc": "The seated cable deadlift is a version of the deadlift or hip hinge movement that is performed on a seated cable row machine. Similar to a stiff-legged deadlift or 45-degree back extension, it targets the muscles of the lower back, as well as the glutes and upper back to a lesser degree. It is usually utilized in higher rep ranges, at least 8-12 reps per set, on a back-focused muscle-building day, or as a deadlift accessory lift to strengthen the lower back.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Smith machine incline bench press-",
        "Desc": "The Smith machine incline bench press is a machine-based movement targeting the chest, particularly the upper chest. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest or upper-body focused workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Cuban press",
        "Desc": "The Cuban press is an exercise that targets the muscles of the shoulders, rotator cuff, and upper back. It combines a shoulder external rotation with a dumbbell press, training multiple muscles and motions in a single sequence. It can be performed standing, or as a more difficult variation face-down on an incline bench. It is usually performed with relatively light weight as part of a dynamic warm-up for upper-body lifting.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "UP Conventional Deadlift",
        "Desc": "The barbell deadlift is a compound exercise used to develop overall strength and size in the posterior chain. It is a competition lift in the sport of powerlifting, but is also considered a classic benchmark of overall strength. When performed with the hands outside the knees, it is often called a \"conventional\" deadlift. When the feet are wide and the hands are inside the knees, it is a sumo deadlift.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Single-arm kettlebell front squat",
        "Desc": "The single-arm kettlebell front squat is a popular kettlebell movement performed while holding a single kettlebell in the front-racked position. It targets the muscles of the lower body dynamically, and the muscles of the upper back and core isometrically. It can be trained in traditional strength or muscle-building rep ranges, in circuit or fat-loss training, or as part of a kettlebell combination or complex.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Crab single-arm reach",
        "Desc": "The crab single-arm reach is a full-body exercise that requires maintaining a tabletop position while alternating arm raises. It is an excellent movement to include in a dynamic warm-up, a bodyweight circuit, or for muscle activation or mobility anytime.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-arm kettlebell clean",
        "Desc": "The single-arm kettlebell clean is an explosive kettlebell exercise where the lifter pulls the weight to shoulder level in a single movement. While the kettlebell clean is often used as a transitional movement into the press or front squat, it is also a valuable strength and power exercise in its own right. It can be performed in low rep ranges for strength or higher rep ranges for technique practice or muscle growth.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "30 Medicine Ball Slam",
        "Desc": "The medicine ball slam is an explosive exercise for developing power, strength, and speed. Muscles worked include the abdominals, legs, triceps, shoulders, and lats. The slams are usually done in rapid succession to complete one set. It can also be a component of a power or athleticism-focused circuit workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Bench dip",
        "Desc": "The bench dip is a highly effective exercise for building the triceps. The resistance comes from the body itself, rather than added weight.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Reverse-grip EZ-bar curl",
        "Desc": "The reverse-grip EZ-bar curl is an exercise targeting the biceps and forearms. Because grip strength is a limitation with this move, it is often performed for moderate to high reps as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Partner bench back extension",
        "Desc": "The partner bench back extension is a clever way to target the glutes and spinal erector muscles. There are machines and angled benches that allow this exercise to be performed solo, but, lacking those, all you need is a bench and a workout partner. It is usually performed for high reps as a burnout or accessory movement for lower-body training.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Knee-to-nose pulse",
        "Desc": "The knee-to-nose pulse is a bodyweight exercise that targets the core by pulsing your knee toward your nose. It starts in a straight-arm plank position, and is similar to a mountain climber, but with a hold or pause in the bent-knee position.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-leg cable stiff-legged deadlift",
        "Desc": "The single-leg cable stiff-legged deadlift is a lower-body exercise that mainly targets the hamstrings, while also benefiting the glutes using a proper hip-hinging motion. Training one leg at a time allows for working out imbalances.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Standing hamstring stretch",
        "Desc": "The standing hamstring stretch is an exercise that stretches the hamstrings, the muscles that cover the back of the thighs. It involves looping a band around one foot and then pulling it, which produces an intense stretch in the hamstrings. It can be performed prior to training the lower body or playing sports, or as a restorative stretch anytime.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Back Extension - Gethin Variation",
        "Desc": "The back extension is an exercise used to build lower back strength that also targets the hamstrings and glutes. It is often performed on a 45-degree bench with the feet anchored. Unweighted back extensions are often performed for high reps, such as 15-20 reps or more, but the movement can also be performed with added weight in lower rep ranges, such as 8-12 reps per set.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Heavy band bent-over row",
        "Desc": "The heavy band bent-over row is a variation of the popular barbell exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lats), lower trapezius, and rear deltoids. It can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Cable stiff-legged deadlift",
        "Desc": "The cable stiff-legged deadlift is a lower-body exercise that mainly targets the hamstrings, while also benefiting the glutes using a proper hip-hinging motion.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Kettlebell deadlift",
        "Desc": "The kettlebell deadlift is a foundational movement in kettlebell training. It's often taught as a buildup or regression to the kettlebell swing, as well as to instruct the \"hip hinge\" motion in a more approachable manner than with a barbell.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Lying Leg Curl - Gethin Variation",
        "Desc": "The lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Single-leg leg extension-",
        "Desc": "The single-leg leg extension is a popular machine-based exercise for the legs, particularly the quadriceps. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training. Performing it one leg a time allows you to focus on the mind-muscle connection of each leg and address muscle imbalances.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Smith machine bench press throw",
        "Desc": "The Smith machine bench press throw is an exercise that helps develop pushing power that carries over to the traditional bench press. It involves pushing a relatively light weight (such as 30-50 percent of your 1RM) explosively and actually letting go at the top of the rep. It can work as power or speed-style training in a strength or athleticism-focused workout plan.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Back Flyes - Gethin Variation",
        "Desc": "The incline dumbbell reverse fly is an upper-body exercise targeting the posterior or rear deltoids, as well as the postural muscles of the upper back. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Barbell Hip Thrust",
        "Desc": "The barbell hip thrust is an exercise that engages the posterior chain, particular the glutes. It involves fully extending your hips while holding a weighted barbell across the midsection.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Lying Close-Grip Bar Curl On High Pulley",
        "Desc": "The lying high-cable biceps curl is an unusual move for building the biceps—but it’s a highly effective one. Lying prone and curling down toward you provides a different stimulus than more standard approaches allow.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "High knees sprawl drill",
        "Desc": "The high knees sprawl drill is a full-body, cardio and strength-focused exercise. It can be performed for reps or time in a fast-paced circuit or other workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm machine high row",
        "Desc": "The single-arm machine high row is a machine-based exercise targeting the back muscles, including the lats, rhomboids, and middle and lower traps. It approximates the motion of a free-weight row, but uses a selectorized weight-stack or plate-loaded machine. Many such machines also allow you to choose between different grips and grip widths. Machine-based rows are often done for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or back-focused portion of a workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Barbell pull-over to press",
        "Desc": "The barbell pull-over to press is a complex that combines two popular exercises into one sequence that works much of the upper body, particularly the chest, triceps, and serratus anterior muscles. It is commonly performed with an EZ-bar, but can also be performed with a straight bar or neutral-grip bar. Because the pull-over will determine the amount of weight you can use, this movement is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body portion of a workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Single-leg cable hip extension",
        "Desc": "The single-leg cable hip extension is an isolation exercise that targets the glutes, specifically the gluteus maximus. It is a common burnout movement on a lower-body focused day and is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Neutral-grip dumbbell bench press",
        "Desc": "The neutral-grip dumbbell bench press is a variation on a classic chest-building exercise where the palms face each other instead of forward. This shift puts the elbows closer to the sides, placing more emphasis on the triceps, and perhaps also the inner chest. The neutral-grip press can be performed in lower reps for strength or higher reps for muscle growth.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Push-Ups - Close Triceps Position",
        "Desc": "The close push-up is an upper-body exercise that targets the chest, triceps, and shoulders. The close hand position places more emphasis on the triceps.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Bent-over dumbbell rear delt row",
        "Desc": "The bent-over dumbbell rear delt row is a popular upper-body exercise that targets the muscles on the backside of the shoulder joint, specifically the medial and rear heads of the deltoid. Since pressing movements build the front and (to a lesser degree) side deltoid heads, this move is often done to promote balanced shoulder development. It is usually performed for high reps, such as 10-15 reps per set or more, as part of a shoulder or upper-body workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell back squat",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Incline Front Dumbbell Raise - Gethin Variation",
        "Desc": "The incline dumbbell front raise is an isolation exercise targeting the shoulders",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Exercise ball rear delt fly",
        "Desc": "The exercise ball rear delt fly is a dumbbell exercise targeting the rear heads of the shoulders, as well as the muscles of the upper-middle back. Lying prone on an exercise ball offers support to perform the movement. It is generally performed for moderate to high reps as a part of upper body or shoulder training.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "TBS Hammer Curl",
        "Desc": "The alternating hammer curl is performed with dumbbells but without wrist supination. Throughout each rep, the wrists remain neutral, like a carpenter hammering a nail.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Glute-Ham Raise - Gethin Variation",
        "Desc": "The glute ham raise is an exercise targeting the glutes and hamstrings on a GHD.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "PJR pull-over-",
        "Desc": "The PJR pull-over is a triceps-focused version of the pull-over exercise, usually performed on either a flat or slightly inclined bench. The low position of the movement stretches the triceps—particularly the long head of the muscle—while the top position is a triceps press that contracts all three heads. It can be done in any type of strength or muscle-focused workout, in traditional muscle-building rep ranges, such as 8-12 reps, or for higher reps.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Natural Glute Ham Raise - Gethin Variation",
        "Desc": "The glute ham raise is an exercise targeting the glutes and hamstrings on a GHD.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "30 Side Plank On Ball",
        "Desc": "The feet-elevated side plank on ball is a more advanced version of a traditional bodyweight side plank. The feet are balanced on an exercise ball, providing a balance challenge but also increasing the load placed upon the obliques and shoulder muscles. It is usually performed for timed holds, either one side at a time or alternating sides. If a ball is unavailable, some of the benefits of the movement can be obtained by performing side planks with the feet elevated on a couch, chair, bench, or other stable object.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Seated Hamstring Curl - Gethin Variation",
        "Desc": "The leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It comes in seated and lying varieties, but the seated leg curl machine is more common in commercial gyms. Leg curl variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Seated Dumbbell Press",
        "Desc": "The seated dumbbell shoulder pressis an exercise for building muscle and strengthening the shoulders, particularly but not exclusively the front heads. The triceps also assist. Some lifters feel that using dumbbells versus a barbell reduced injury risk.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Smith machine close-grip bench press-",
        "Desc": "The Smith machine close-grip bench press is a machine-based movement targeting the chest and triceps. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest, arms, or upper-body focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Kettlebell alternating renegade row",
        "Desc": "The kettlebell alternating renegade row combines rowing and core training into a single difficult movement. It's popular in time-efficient strength and muscle-building workouts, as well as in circuit-style training.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Machine Seated Chest Press - Gethin Variation",
        "Desc": "The machine chest press is an upper body exercise targeting the pectoral muscles.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Medicine ball sprawl to chest press",
        "Desc": "The medicine ball sprawl to chest press is a sequence of athletic movements using a medicine ball or other small weight. It involves performing a sprawl with the hands on the ball, followed by a standing chest press holding the ball. It is challenging to the cardiovascular system, but also the muscles of the core, shoulders, and upper back. It can be performed for reps or for time, usually in dedicated ab training or as part of a medicine ball and bodyweight circuit workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Chin-Up",
        "Desc": "The a chin-up is a variation of the pull-up exercise in which the reps are performed with the palms facing toward the body, in an underhand position, with a grip that is narrower than shoulder-width. Like other pull-up variations, it builds strength and muscle in the upper back, biceps, and core, but it utilizes the biceps slightly more than overhand pull-ups. It can be used as a more shoulder-friendly alternative to straight-bar pull-ups, or to help perform more reps than you can perform overhand.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Lunge kick",
        "Desc": "The lunge kick is a lower-body, cardio-based exercise performed at a high intensity. It includes a kick of the front leg to make the movement more powerful. It can be performed either for time or reps and is a great inclusion in a fat-loss or athleticism-focused circuit workout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "FYR Dumbbell front raise to lateral raise",
        "Desc": "The dumbbell front raise to lateral raise combines two exercises that build and strengthen the middle deltoids and the anterior deltoids of the shoulders.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Reverse-grip bench press",
        "Desc": "The reverse-grip bench press is a popular barbell exercise targeting the chest, triceps, and forearms. The main difference between this exercise and the standard bench press is that the grip is underhand, not overhand. This helps target both the upper chest and the triceps. This lift can feel awkward at first, so go light and don't be afraid to use a spotter.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Smith Machine Close-Grip Bench Press",
        "Desc": "The Smith machine close-grip bench press is a machine-based movement targeting the chest and triceps. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest, arms, or upper-body focused workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Dumbbell skier",
        "Desc": "As the name suggests, the dumbbell skier takes the motion of skiing and replaces the poles with dumbbells. The hip and torso motion are similar to a kettlebell swing, as are the muscles it targets, including the hamstrings, glutes, upper back, and grip. However, unlike the traditional kettlebell swing, the arms are outside of the knees. This movement can be performed for time or for reps, but is usually performed for relatively high reps, such as 8-12 sets per rep or more, as part of a fat-loss or athleticism-focused circuit or workout.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Lying cable leg curl",
        "Desc": "The lying cable leg curl is a classic machine exercise for building greater muscle size and strength in the hamstrings. It's easy to learn, easy to master, and poses little in the way of injury risk. It is usually performed for moderate to high reps, at least 8-12 reps per set, as part of lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Clock push-up",
        "Desc": "The clock push-up is a series of regular push-ups performed one at a time, moving your hands one step to the side between each one until you've completed a full circle. It targets the same muscles as traditional push-ups, such as the chest, triceps, and shoulders, but adds an endurance and core challenge to traditional push-ups.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Side-to-side push-up",
        "Desc": "The side-to-side push-up is a variation of the push-up exercise where you side-step the opposite hand and foot and perform a push-up.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Total Fitness Hamstring Slide",
        "Desc": "The hamstring slide is a bodyweight exercise targeting the hamstrings. Lying supine on a smooth surface, you bend your knees to pull both heels toward you. The sliding action requires a pad, cloth, or furniture sliders under the heel. These are considered more difficult than exercise ball hamstring curls, and are a great primer movement before heavy squats or deadlifts, or as an accessory movement later in a lower-body workout.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Glute bridge step-out",
        "Desc": "The glute bridge step-out is a lower-body bodyweight exercise that targets the glutes and hamstrings. It differs from a glute bridge by the addition of a step-out, which increases stress on the hamstrings. It can be performed for time or reps and works perfectly in a dynamic warm-up for lower-body training, but can also be performed for glute activation anytime.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Glute ham raise-",
        "Desc": "The glute ham raise is an exercise targeting the glutes and hamstrings on a GHD, or glute ham developer bench. The unassisted version of the movement requires serious hamstring strength, so it is more common to see versions that use a band or PVC pipe for assistance. It is commonly performed as an accessory movement for heavy barbell lifts. While a single rep may be a struggle at first, with time, strong athletes can build up to doing them for 8-12 reps per set.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "One Handed Hang",
        "Desc": "The single-arm hang is a static exercise that involves hanging from a bar by one hand. It is an advanced hanging exercise that demands above-average shoulder stability and grip strength, and may not be appropriate for some people. However, if someone is strong and stable enough to perform it, the movement can help build those same qualities.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Forward lunge",
        "Desc": "The forward lunge is a lower-body bodyweight exercise targeting the quads, glutes, and hamstrings. It can also be performed holding dumbbells or other weights. The forward lunge places more emphasis on the quads than other lunge variations. It can be performed for time or reps in the lower-body portion of any workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm band low row",
        "Desc": "The single-arm band low row is a single-arm row variation utilizing a band for resistance that is anchored low. It targets the muscles of the middle back, like the lats (latissimus dorsi) and rhomboids, but also the core. It is usually performed for moderate to high reps, at least 8-15 reps per set, in the later stages of a back or upper-body workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Barbell floor wiper",
        "Desc": "The barbell floor wiper is a core exercise in which the barbell is held in the locked-out position of a floor press, and the hips and legs are rotated side to side. It targets the oblique muscles of the lateral abdomen, but is also seriously challenging to the deep core and rectus abdominis or \"six-pack\" muscles.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Levitating side kick-through",
        "Desc": "The levitating side kick-through is a full-body movement that starts in a bear crawl position and ends with a leg kicked out to the side. In between reps, you kick into the air in a partial handstand. It is commonly performed for reps or time in bodyweight circuits and animal-style flows, but can also work on its own or as part of a dynamic warm-up or mobility sequence.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Dumbbell single-leg hip thrust",
        "Desc": "The dumbbell single-leg hip thrust is a single-sided exercise that targets the posterior chain, particularly the glutes and hamstrings. It involves balancing on one foot and fully extending your hips while holding a dumbbell across the front of your hip. It is a great movement to activate the glutes prior to other lower-body training, but can also be performed in the main part of a workout, or for high reps as a glute burnout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "FYR Banded Plank Jack",
        "Desc": "The banded plank jack is a variation on the plank that involves moving the legs in and out for repetitions. Having a band around the thighs forces the lower body to work harder, particularly the hips and glutes. The plank jack is commonly performed as part of a bodyweight circuit, or as part of a dynamic warm-up.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Judo push-up",
        "Desc": "The judo push-up is an advanced push-up variation that blends elements of the yoga poses downward- and upward-facing dog. This movement increases the demands on the shoulders, but also has mobility benefits. It can work in a dynamic warm-up or mobility-focused workout, but also in bodyweight strength training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Smith Machine Decline Press",
        "Desc": "The Smith machine decline bench press is a machine-based exercise targeting the chest muscles, particularly the lower pectoral muscles. The Smith machine mimics a barbell but provides more stability. This movement is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest or upper-body workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Reverse Grip Triceps Pushdown",
        "Desc": "The reverse-grip cable straight-bar push-down is a twist on the popular cable straight-bar push-down. The difference has to do with how the hands are positioned holding the bar: the palms facing up rather than down. Because grip will be a limiting factor, this movement is usually performed for moderate to high reps, such as 8-12 reps per set or higher.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Paul Carter Romanian Deadlift",
        "Desc": "The barbell stiff-legged deadlift targets the hamstrings, glutes, lower and upper back, as well as the core. It is a popular accessory movement for the deadlift, but also a muscle-building hamstring movement.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Superman",
        "Desc": "The Superman is a bodyweight exercise that consists of isometric holds in an extended spine position. It targets the muscles of the posterior chain, including the muscles of the glutes, spinal erectors, and upper back. It can be performed as part of a dynamic warm-up, or for muscle activation or mobility anytime.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Stiff-Legged Dumbbell Deadlift",
        "Desc": "The dumbbell stiff-legged deadlift targets the hamstrings, glutes, low and upper back, as well as the core. The purpose of the stiff-legged, as opposed to Romanian deadlift with slightly bent knees, is to engage the hamstrings and low back to an even greater degree.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Single-arm kettlebell row",
        "Desc": "The single-arm kettlebell row is a popular muscle- and strength-building exercise that works the muscles of the back and core simultaneously. It has all the same benefits as a single-arm dumbbell row, but some people find a kettlebell more comfortable to hold during the movement.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Cable rope push-down",
        "Desc": "The cable rope push-down is a popular exercise targeting the triceps muscles. It's easy to learn and perform, making it a favorite for everyone from beginners to advanced lifters. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Decline reverse crunch",
        "Desc": "The decline reverse crunch is a popular bodyweight exercise targeting the abdominal muscles, particularly the lower abs. It is usually performed for high reps, such as 10-15 reps per set or more, as part of the ab-focused portion of a workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Box jump",
        "Desc": "The box jump is an explosive exercise that strengthens the muscles of the lower body, including the quads, glutes, calves, and hamstrings. They also develop power in the lower body while revving the heart rate. Box jumps can be performed for low reps to focus on strength and power, or for higher reps for metabolic conditioning. Most coaches recommend stepping down rather than jumping down between reps.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Biceps curl to shoulder press",
        "Desc": "The biceps curl to shoulder press is a dumbbell complex that combines two exercises that build and strengthen the biceps and shoulders or deltoids. It is usually performed one rep of each movement at a time, although you could perform more reps of each, or increase the reps in successive rounds (e.g., 1 rep in round 1, 2 reps in round 2, etc.). No matter how you structure the sets and reps, it is a time-efficient way to hit two crucial upper-body muscles in any workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Incline cable rope triceps extension",
        "Desc": "The incline cable rope triceps extension is a single-joint arm exercise performed on an incline bench. This incline position offers a great stretch and range of motion, potentially targeting the long head of the triceps more than some other triceps exercises. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Medicine ball twist",
        "Desc": "The medicine ball twist is an exercise targeting the abdominal muscles, particularly the obliques. It is similar in many ways to a Russian twist exercise. The ball is held tight to the chest throughout the movement, and then the torso is rotated from side to side for the desired number of reps or a set amount of time.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Side kick-through to kettlebell high pull",
        "Desc": "The side kick-through to kettlebell high pull is a combination of a popular bodyweight exercise and an explosive kettlebell movement. Between them, the pairing targets the traps, shoulders, core, hips, hamstrings, and glutes. This combination can be performed for time or for reps, often as circuit-style training for conditioning or fat loss.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Alternating standing shoulder press",
        "Desc": "The alternating standing shoulder press is a popular dumbbell exercise targeting the shoulders. It can be performed in strength-focused rep ranges, such as 5-8 reps per set, or for higher reps to build muscle or for conditioning.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Latissimus dorsi SMR",
        "Desc": "Latissimus dorsi self-myofascial release (SMR) is a self-administered soft-tissue treatment for the upper body, usually using a foam roller, lacrosse ball, or other \"trigger point\" massage tool. By applying pressure strategically to the lat muscles of the mid back, some people find they can cause this often painful and tight area to relax or \"release.\" Latissimus dorsi SMR is often accompanied by SMR on the pectorals or rhomboids, or by stretches that target the lats.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Band push-up",
        "Desc": "The band push-up is a progression of the popular bodyweight version of the exercise commonly used in military and tactical physical fitness tests. Adding the dynamic resistance of the band matches the strength curve of the push-up and helps build upper-body muscle and strength, emphasizing the chest, triceps, and shoulders, but also working the upper back and core.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Seated Leg Curl",
        "Desc": "The leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It comes in seated and lying varieties, but the seated leg curl machine is more common in commercial gyms. Leg curl variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "AM Dumbbell Bench Press",
        "Desc": "The dumbbell bench press is a mainstay of workout enthusiasts worldwide. It’s a classic move for building a bigger, stronger chest. As such, it’s often placed first in mass-building chest workouts.",
        "BodyPart": "Chest"
    },
    {
        "Title": "King Maker Hack Squat",
        "Desc": "The hack squat is a machine-based exercise that targets the muscles of the legs, particularly the quadriceps. It is often used as an accessory for squats, but can also be the main lower-body movement in a workout. It is often performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Body Triceps Press Using Flat Bench",
        "Desc": "The bodyweight triceps press is an arm movement that involves performing overhead presses in a face-down position on a Smith machine or other raised bar. It is a surprisingly difficult movement that hammers all three heads of the triceps and can easily be scaled upward or downward in difficulty by moving the bar.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Diamond push-up",
        "Desc": "The diamond push-up is an advanced variation of the push-up exercise performed with the hands in a diamond shape. It increases the challenge to the triceps, but also targets the chest and shoulders.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Double-kettlebell windmill",
        "Desc": "The double-kettlebell windmill is an advanced kettlebell exercise emphasizing core strength and shoulder and hip mobility and stability. Because it involves holding one weight overhead while holding another under the torso, it builds strength across the core and stability in the shoulders. It doesn't work well in a metcon or conditioning setting, and shouldn't be performed under intense fatigue.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Incline Front Barbell Raise - Gethin Variation",
        "Desc": "The incline face-down bar front raise is an upper-body exercise targeting the shoulders. Because it is performed face down on an angled bench, it has a greater range of motion than standing or upright-seated raises and hits the shoulders from a different angle. Raise variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or shoulder-focused training.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Dumbbell floor press",
        "Desc": "The dumbbell floor press is a multijoint pressing exercise performed lying on the floor. It can be performed either with the knees bent or flat. The floor press limits the range of motion you would achieve with a regular dumbbell bench press, but still targets the chest, triceps, and anterior delts. This allows you to press more weight than in a dumbbell bench press, and perhaps put less stress on the shoulders.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "AM Cable Biceps Curl",
        "Desc": "The cable straight-bar biceps curl takes a classic bodybuilding exercise, the standing barbell curl, and replaces the barbell with a handle attached to a cable. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Smith machine back squat",
        "Desc": "The Smith machine back squat is a machine-based exercise targeting the muscles of the lower body. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a full-body or lower-body workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "TBS Back Extension",
        "Desc": "The back extension is an exercise used to build lower back strength that also targets the hamstrings and glutes. It is often performed on a 45-degree bench with the feet anchored. Unweighted back extensions are often performed for high reps, such as 15-20 reps or more, but the movement can also be performed with added weight in lower rep ranges, such as 8-12 reps per set.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Seated cable biceps curl",
        "Desc": "The seated cable biceps curl is a single-joint arm exercise intended to isolate the biceps. The seated position helps eliminate the use of momentum. This movement is usually performed for moderate to high reps for a burn and pump as part of an arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Exercise ball hip thrust",
        "Desc": "The exercise ball hip thrust is a simple yet effective way to work the glutes and hamstrings. Proper form is essential to really feel the burn in the glutes, and the ball can help guide you into the right form better than a bench, which is the usual support for hip thrusts. Unlike the bench version, the ball hip thrust is best performed with body weight or bands as resistance for safety reasons. It can be an excellent component of a warm-up for lower-body training, or a glute activation drill performed anytime.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Single-arm landmine press",
        "Desc": "The single-arm landmine press is an upper-body exercise that uses an angled barbell anchored at floor level in a landmine device. It can also be performed by sticking a barbell in the corner of a room, preferably in a towel to protect the walls. The angle of a landmine press is usually somewhere between an incline press and a military press, and the movement focuses primarily on the muscles of the shoulders or deltoids. It can be trained in traditional muscle and strength-focused rep ranges or for higher reps.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Incline Dumbbell Fly - Gethin Variation",
        "Desc": "The incline dumbbell chest fly is an upper body isolation exercise targeting the upper chest and is typically used with aesthetic goals in mind. It will require less weight than an incline press, which makes it a great hypertrophy exercise with high reps.",
        "BodyPart": "Chest"
    },
    {
        "Title": "TBS Barbell Military Press",
        "Desc": "The military press is a compound movement used to build size and strength in the shoulders. It was once contested as a fourth powerlift, but is rarely competed anymore. However, being able to press a significant weight overhead remains a popular marker of upper-body strength. The military press can be trained as a strength lift or in traditional muscle-building rep ranges as part of full-body, shoulder-focused, or upper-body training.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell deadlift-",
        "Desc": "The barbell deadlift is a compound exercise used to develop overall strength and size in the posterior chain. It is a competition lift in the sport of powerlifting, but is also considered a classic benchmark of overall strength. When performed with the hands outside the knees, it is often called a \"conventional\" deadlift. When the feet are wide and the hands are inside the knees, it is a sumo deadlift.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Smith machine bent-over row",
        "Desc": "The Smith machine bent-over row is an upper-body exercise targeting the muscles of the back, particularly the lats (latissimus dorsi). This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or back-focused workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Dumbbell Seal Row - Gethin Variation",
        "Desc": "The dumbbell seal row is a weighted exercise targeting the muscles of the middle back, including the lats (latissimus dorsi) and rhomboids. It can be performed on a special elevated bench, on a bench placed on top of boxes or benches, or on a bench with a slight incline. The higher the bench, the greater the range of motion and stretch at the bottom of the movement. It is usually performed as an assistance movement for back strength and muscle growth, in rep ranges of 8-12 reps per set or higher.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Barbell good morning",
        "Desc": "The barbell good morning is an exercise that targets glute, hamstring, and lower back development. It is often trained as an accessory movement to the deadlift, but also has value on its own. It is sometimes performed for reps in traditional strength-focused rep ranges such as 5-8 reps per set, but due to the risk posed to the lower back, is rarely treated as a max-effort single-rep lift.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Around-the-world pull-up",
        "Desc": "The around-the-world pull-up is a more advanced version of the classic pull-up. It focuses stress more directly on the individual arms or sides of the back, while also boosting the time under tension at the top of each rep. It can be used as a progression toward a one-arm pull-up, or simply as a way to increase the challenge and variety of your pull-up training.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Band deadlift",
        "Desc": "The band deadlift is a lower-body exercise that mainly targets the hamstrings while also benefiting the glutes and lats using a proper hip-hinging motion.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "AM Bar Triceps Push-Down",
        "Desc": "The cable straight-bar push-down is a popular gym exercise for targeting the triceps. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Smith machine inverted row",
        "Desc": "The Smith machine inverted row is a bodyweight exercise targeting the muscles of the lats (latissimus dorsi) and upper back, using the bar of the Smith machine to hang and pull from. You can change the bar height to customize the difficulty level and desired angle of the row. This variation is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Lat Pull-down - Gethin Variation",
        "Desc": "The lat pull-down is a cable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Russian Bar Dip",
        "Desc": "The Russian dip is a chest-and-triceps building exercise that resembles the chest dip, albeit with a twist that makes it even harder and more taxing.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Single-arm kettlebell swing",
        "Desc": "The single-arm kettlebell swing is a popular exercise emphasizing the muscles of the hamstrings, glutes, and back. Because you are only swinging with one arm at a time, it is also uniquely challenging to the grip and core muscles. It is often used to train explosive power, for aerobic or cardiovascular conditioning, or in circuit training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Single-arm kettlebell row-",
        "Desc": "The single-arm kettlebell row is a popular muscle- and strength-building exercise that works the muscles of the back and core simultaneously. It has all the same benefits as a single-arm dumbbell row, but some people find a kettlebell more comfortable to hold during the movement.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Barbell Squat - Gethin Variation",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Double-kettlebell shoulder press",
        "Desc": "The double-kettlebell shoulder press is a popular movement in strength and muscle-focused kettlebell workouts. Each set is started by cleaning the weights up to the rack position. The weights can optionally be re-cleaned between each rep, which is known as a clean and press. The double press can be trained in traditional strength or muscle-growth rep ranges (e.g., 5x5 or 8-12 reps per set), or in circuit-style fat-loss training or kettlebell complexes.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Incline Push-Up",
        "Desc": "The hands-elevated push-up is a variation on the push-up, a body-weight standard. The hands are elevated, so that your body is aligned at an angle to the floor rather than parallel.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Cable straight-bar biceps curl",
        "Desc": "The cable straight-bar biceps curl takes a classic bodybuilding exercise, the standing barbell curl, and replaces the barbell with a handle attached to a cable. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Lower Back Stretch - Yates Variation",
        "Desc": "The lying cross-over lower back stretch is a simple bodyweight stretch targeting the lower back, hips, and torso. It involves rotating the legs while lying flat on the back. It is commonly included in dynamic warm-ups, but can also be performed as full-body mobility work anytime.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "30 Cable Reverse Crunch On Ball",
        "Desc": "The cable reverse crunch on a BOSU is performed on top of a BOSU ball between two cable pulleys, which helps target the lower abdominals specifically and is more proprioceptively challenging than a cable reverse crunch on the floor.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Alternating lunge jump",
        "Desc": "The alternating lunge jump is an explosive bodyweight exercise that targets the lower-body muscles, including the quads, glutes, and hamstrings. It can be performed for time or reps in power training, and is also effective in any fat-loss or athleticism-focused workout.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Close-grip pull-down",
        "Desc": "The close-grip pull-down is a variation on the lat pull-down that is performed with an overhand grip and the hands slightly closer than shoulder-width apart. This increases the range of motion beyond wider grips, and may increase the time under tension in each rep. This variation is usually performed for moderate to high reps as part of a back or upper-body workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Romanian Deadlift With Dumbbells",
        "Desc": "The dumbbell stiff-legged deadlift targets the hamstrings, glutes, low and upper back, as well as the core. The purpose of the stiff-legged, as opposed to Romanian deadlift with slightly bent knees, is to engage the hamstrings and low back to an even greater degree.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Bent-arm barbell pull-over",
        "Desc": "The bent-arm barbell pull-over was a staple exercise of the \"Golden Era\" of bodybuilding and a favorite of Arnold Schwarzenegger himself. Done properly, the exercise targets the pecs, lats, and serratus anterior muscles. Old-school bodybuilders would perform them with light weights for sets of 20 between sets of heavy 20-rep squats, but pull-overs are more popular today in moderate rep ranges, such as 8-12 reps per set, as part of an upper-body workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Alternating sit-through with crunch",
        "Desc": "The alternating sit-through with crunch is a full-body movement that starts in a bear crawl position and ends with a leg kicked out to the side. In between reps, you perform a crunch. It is commonly performed for reps or time in bodyweight circuits and animal-style flows, but can also work on its own or as part of a dynamic warm-up or mobility sequence.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "BFR underhand straight-bar push-down",
        "Desc": "The blood flow restriction (BFR) underhand straight-bar push-down is an arm movement that builds triceps size and strength using a cable stack, straight-bar grip, and blood flow restriction bands. It is popular in high-rep \"pump\"-style arm workouts. The bands should be placed as high as possible on your arms, at a tightness of no greater than 8 on a scale of 10. Most BFR workouts recommend using a far lighter weight than usual, perhaps as low as 25-50 percent of a normal working weight.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Dumbbell Bulgarian split squat",
        "Desc": "The dumbbell Bulgarian split squat is a single-leg exercise targeting the quads, glutes, and hamstrings. Overloading the movement with dumbbells usually presents less of a balance challenge than putting a barbell on the back. Dumbbell split squats are usually performed for moderate to high reps, such as 8-12 reps per leg, but they are also effective done with heavier weights in lower rep ranges.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Plank - Gethin Variation",
        "Desc": "The elbow plank is a popular isometric abdominal exercise. It is common in all types of exercise programs, as well as in group fitness and yoga classes. It targets the muscles of the core, the deep core or transversus abdominis in particular. It is also often prescribed for time to help back pain or to teach proper bracing.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-leg kettlebell deadlift",
        "Desc": "The kettlebell single-leg deadlift is a variation on the kettlebell deadlift where one foot stays planted on the ground while the other raises into the air at the bottom of the movement. It's popular in lower-body training for strength and muscle building, but also trains balance, grip, and the core muscles.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Single-leg balance and reach",
        "Desc": "The single-leg balance and reach is an exercise that focuses on lower-body strength and stability.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Dumbbell bent-over row",
        "Desc": "The dumbbell bent-over row is a popular exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lat), lower trapezius, and rear deltoids. It can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Paul Carter Rear-Delt Fly",
        "Desc": "The seated rear delt fly is an upper-body exercise that targets the real deltoid of the shoulder. By performing the movement seated, it eliminates momentum from the rest of the body. This movement is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or shoulder-focused portion of a workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Squatting cable EZ-bar biceps curl",
        "Desc": "The squatting cable EZ-bar biceps curl is an exercise that builds and strengthens the biceps while the lower body is in a static squat position. It is usually performed for higher rep sets, such as 8-12 reps per set or more, in combination with other curls or arm training. It is most similar in arm positioning to a preacher curl, but has some unique benefits to the lower body, as well.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Preacher Curl",
        "Desc": "The EZ-bar preacher curl is a classic exercise for building bigger biceps. This move is all about isolation. With the back of the upper arms against the pad, it’s next to impossible to cheat. Go light, get a great pump, and build that peak!",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Feet-elevated bench dip",
        "Desc": "The feet-elevated bench dip is a popular bodyweight exercise for building the triceps, chest, and shoulders. Elevating the feet brings more chest and shoulder into the movement, but also allows for extra weight on the hips. If these bother your shoulders, try performing them between two benches or chairs rather than on a single bench.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Incline Bench Rear Dumbbell Fly - Gethin Variation",
        "Desc": "The incline dumbbell reverse fly is an upper-body exercise targeting the posterior or rear deltoids, as well as the postural muscles of the upper back. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Hollow-body abduction",
        "Desc": "The hollow-body abduction is an isometric core exercise that includes leg abductions for an added challenge to the core and abductors. It targets multiple muscles of the core, but particularly the rectus abdominis or \"six-pack\" muscles. It can be performed for time or reps in the ab-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Standing band biceps curl",
        "Desc": "The standing band biceps curl is an arm-focused exercise using a band for resistance. This variation is usually performed for moderate to high reps as part of an arms-focused or upper-body workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Cable Cross-Over - Gethin Variation",
        "Desc": "The cable cross-over is an isolation movement that uses a cable stack to build bigger and stronger pectoral muscles. Since it's done using adjustable pulleys, you can target different parts of your chest by setting the pulleys at different levels. It is common in upper body and chest-focused muscle-building workouts, often as a pre-exhaust at the beginning of a workout, or a finishing movement at the end. It is often in combination with other presses or flyes to target the chest from different angles.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Decline dumbbell bench press",
        "Desc": "The decline dumbbell bench press is a popular upper-body exercise targeting the lower pectoral muscles. While it can be a strength-focused movement, it is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Paul Carter Concentration Curl",
        "Desc": "The concentration curl is a classic exercise for building the biceps one arm at a time. It can be performed bent over or kneeling, but is more often performed seated on a bench. It's great for emphasizing the biceps peak and is often used to finish a biceps workout. Like most curl variations, these are usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Incline dumbbell overhead triceps extension",
        "Desc": "The incline dumbbell overhead triceps extension is a popular exercise targeting the triceps muscles. The incline angle helps to target the long head of the triceps in particular. This exercise is usually performed for moderate to high reps as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Curtsy lunge",
        "Desc": "The curtsy lunge is a lower-body bodyweight movement that targets the muscles of the hips and glutes. It is usually performed for moderate to high reps, at least 8-12 reps per leg.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "King Maker Pull-Up",
        "Desc": "The pull-up is a multi-joint bodyweight exercise that builds strength and muscle in the upper back, biceps, and core. It is often used as a measurement tool in military or tactical fitness tests, and is an excellent gauge of “relative strength” which is strength in relation to bodyweight.",
        "BodyPart": "Lats"
    },
    {
        "Title": "FYR Dumbbell Arnold Press",
        "Desc": "Named after the iconic bodybuilder/movie star, the Arnold press adds rotation to a classic shoulder press, hitting all three heads of the deltoids in one motion.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Treadmill jogging",
        "Desc": "Treadmill jogging is a popular cardiovascular exercise performed on a machine that is available in most gyms. Performing this exercise on a treadmill allows you to adjust the speed of your jogging and, depending on the machine, perform it on an adjustable incline. Many machines also have built-in heart rate monitors and timers to help you track your progress.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Medicine ball ninja",
        "Desc": "The medicine ball ninja is a dynamic medicine ball movement that challenges both the upper and lower body, while also elevating the heart rate. It's a great movement to include in medicine ball or bodyweight circuit training to increase fatigue and burn serious calories while hammering the muscles of the legs.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Hammer Curls",
        "Desc": "This curl is performed simultaneously with dumbbells but without wrist supination. Throughout each rep, the wrists remain neutral, like a carpenter hammering a nail.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Eiffel Tower leg raise",
        "Desc": "The Eiffel Tower leg raise is a bodyweight exercise targeting the muscles of the abs, the rectus abdominis or “six-pack” muscles in particular. It is similar to a V-up, but with the added challenge of “drawing” a pyramid shape in the air with the legs during each rep. It can be performed for time or reps in the core-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-arm barbell bent-over row",
        "Desc": "The single-arm barbell bent-over row is a barbell exercise focused on the muscles of the middle back, such as the lats (latissimus dorsi) and rhomboids. It also targets the biceps and grip. If the loose end of the barbell moves around, it can be secured by placing it in the corner of a room.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Lying high-cable biceps curl",
        "Desc": "The lying high-cable biceps curl is a single-joint exercise targeting the biceps in a prone (face-up) position. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Hand Stand Push-Up",
        "Desc": "The handstand push-up is an exercise targeting the shoulders, although other muscles assist in the completion of the reps. It is common in both CrossFit workouts and advanced bodyweight or calisthenics training. Given the degree of difficulty, beginners will want to progress to this move.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Standing One-Arm Cable Curl",
        "Desc": "The single-arm cable biceps curl is a single-joint isolation exercise for building the biceps. This move is intended to be strict and deliberate; this is not an exercise for using momentum or otherwise cheating.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Standing dumbbell knee crunch",
        "Desc": "The standing dumbbell knee crunch is a great way to train the abs while standing up. Additionally, the deltoids are worked because the lifter holds a pair of dumbbells overhead throughout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "UP Hamstring Curl",
        "Desc": "The lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Reverse crunch",
        "Desc": "The reverse crunch is a popular exercise targeting the abdominals, particularly the lower half. It’s easy to perform on either the floor or a flat bench. Many lifters think of this as a companion to the crunch, which targets the upper abdominals more than the lower.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-arm dumbbell skullcrusher",
        "Desc": "The single-arm dumbbell skullcrusher is a triceps exercise that has been a staple of bodybuilders for decades. Skullcrushers are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arms-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "King Maker Incline Barbell Bench Press",
        "Desc": "The incline bench press is an upper body compound movement that targets the upper chest.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Incline dumbbell bench press",
        "Desc": "The incline dumbbell bench press is a popular upper-body exercise targeting the upper pectoral muscles. While it can be a strength-focused movement, it is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Single-arm machine preacher curl",
        "Desc": "The single-arm machine preacher curl is a popular exercise to build size and strength in the biceps. It approximates the motion of a free-weight preacher curl, but uses a selectorized weight stack or plate-loaded machine. Many such machines offer different grips and grip widths. Machine biceps curls are often done for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Man-maker",
        "Desc": "The man-maker is a sequence of exercises combining a dumbbell front squat, military press, renegade row, and sprawl. Between these movements it challenges muscles across the body, along with the cardiovascular system. It can be performed for rounds or for time as a single full-body exercise or as part of a fat-loss or athleticism-focused workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Side plank hip dip",
        "Desc": "The side plank hip dip is a dynamic version of the side plank exercise focusing on the oblique muscles, as well as the transversus abdominis or deep core muscles. It can be performed for time or reps and can work in a warm-up or in the core-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Elevated Cable Rows",
        "Desc": "The cable seated row is a popular exercise to train the muscles of the upper back, including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, using a cable stack. It also targets the biceps to a lesser degree. The cable row can work well in a variety of rep-ranges, but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Leg Extensions - Gethin Variation",
        "Desc": "The leg extension is an isolation exercise for the quads.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Standing leg swing",
        "Desc": "The standing leg swing is a dynamic stretching exercise that involves moving one leg up in front of you, as if to punt an imaginary football. This is a classic move for warming up the body and stretching the hamstrings.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Barbell Deadlift",
        "Desc": "The barbell deadlift is a compound exercise used to develop overall strength and size in the posterior chain. It is a competition lift in the sport of powerlifting, but is also considered a classic benchmark of overall strength. When performed with the hands outside the knees, it is often called a \"conventional\" deadlift. When the feet are wide and the hands are inside the knees, it is a sumo deadlift.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Kneeling lat pull-down",
        "Desc": "The kneeling lat pull-down is a variation of the lat pull-down exercise performed with the knees on the ground rather than sitting on a bench or machine. It has all of the same benefits of a lat pull-down performed on a bench or machine, in addition to providing further activation to the core and lower body.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Dumbbell renegade row",
        "Desc": "The dumbbell renegade row combines rowing and core training into a single difficult movement. It's popular in time-efficient strength and muscle-building workouts, as well as in circuit-style training.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Standing cable rear delt row",
        "Desc": "The standing cable rear delt row primarily targets the rear deltoids. This movement also hits the traps, rhomboids, and biceps. It is usually performed for moderate to high reps, at least 8-12 reps per set, as part of an upper-body or shoulder-focused workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Cable overhead triceps extension",
        "Desc": "The cable overhead triceps extension is a cable exercise performed in a seated position, targeting the triceps muscles. While it hits all three heads of the triceps, the overhead position helps to target the long head in particular. The seated position helps eliminate the use of momentum. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Medicine Ball Chest Pass",
        "Desc": "The medicine ball pass is a simple partner-based exercise that involves throwing a weighted ball back-and-forth. It can be part of a dynamic warm-up for lifting or athletics, but can also work as active rest or as a component of circuit training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Dumbbell goblet squat-",
        "Desc": "The goblet squat is a popular lower-body exercise in which a dumbbell or kettlebell is held in front of the chest with two hands, approximating how you might hold a heavy goblet. It is used as a teaching tool to help instruct and develop proper squat form, but is also effective for building size in the quads, glutes, and hamstrings. It can be performed for low reps to build strength, or for higher reps to build muscle and conditioning.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Cable rope hammer curl",
        "Desc": "The cable rope hammer curl is a popular arm-focused exercise performed with a rope handle attached by a cable to a weight stack. It uses a neutral (palms facing one another) grip, which targets the forearms and brachialis muscles in addition to the biceps. Because grip is a limitation, it is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Bent-knee reverse crunch",
        "Desc": "The bent-knee reverse crunch is a popular bodyweight core exercise. It targets the lower portion of the rectus abdominis or \"six-pack\" muscles. It can be performed for time or reps as part of any ab-focused workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Decline Smith Press",
        "Desc": "The Smith machine decline bench press is a machine-based exercise targeting the chest muscles, particularly the lower pectoral muscles. The Smith machine mimics a barbell but provides more stability. This movement is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest or upper-body workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Band overhead triceps press",
        "Desc": "The band overhead triceps press is a dynamic arm exercise utilizing a looped exercise band. It could also be performed with an exercise band with handles. It targets the triceps muscles and can be performed for time or reps, either in traditional muscle-building rep ranges such as 12-15 reps per set, or higher rep ranges such as 30, 50, or more.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Bent-over dumbbell rear delt fly",
        "Desc": "The bent-over dumbbell rear delt fly is a popular upper-body exercise that targets the muscles on the back of the shoulder joint, specifically the rear head of the deltoid. Since pressing movements build the front and (to a lesser degree) side deltoid heads, this move is often done to promote balanced shoulder development. It is usually performed for high reps, such as 10-15 reps per set or more, as part of a shoulder or upper-body workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "TBS Deficit Deadlift",
        "Desc": "The barbell deficit deadlift is a compound exercise targeting the posterior chain.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Incline Dumbbell Curl - Gethin Variation",
        "Desc": "The incline dumbbell biceps curl is an isolation exercise targeting the biceps. This variation targets the long head of the biceps more than a traditional curl and there is more overall tension to this muscle.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Medicine ball partner twist",
        "Desc": "The medicine ball partner twist is a plyometrics exercise targeting the core muscles, particularly the obliques. You and a partner stand back to back and rotate in unison to pass a medicine ball back and forth on alternating sides.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Machine Triceps Extension - Gethin Variation",
        "Desc": "The machine triceps extension is an isolation exercise targeting the tricep muscles.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Kettlebell One-Legged Deadlift",
        "Desc": "The kettlebell single-leg deadlift is a variation on the kettlebell deadlift where one foot stays planted on the ground while the other raises into the air at the bottom of the movement. It's popular in lower-body training for strength and muscle building, but also trains balance, grip, and the core muscles.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Wide mountain climber",
        "Desc": "The wide mountain climber is a popular bodyweight exercise targeting the muscles of the core, as well as the shoulders, hips, and cardiovascular system. It is different from a traditional mountain climber because you bring the knee to the outside of the elbow rather than the inside. It can be performed for time or reps as part of a dynamic warm-up, for bodyweight cardio or conditioning, or as no-equipment dynamic core training.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "V-sit with overhead triceps extension",
        "Desc": "The V-sit with overhead triceps extension is a hybrid movement that trains the abdominal and triceps muscles simultaneously. It can address multiple muscle groups in a time-efficient muscle-building or circuit-style workout, while also providing a cardiovascular challenge.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Barbell stiff-legged deadlift",
        "Desc": "The barbell stiff-legged deadlift targets the hamstrings, glutes, lower and upper back, as well as the core. It is a popular accessory movement for the deadlift, but also a muscle-building hamstring movement.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Straight-arm rope pull-down",
        "Desc": "The straight-arm rope pull-down is a variation of the straight-arm lat pull-down performed using a cable stack machine and a rope grip. It can either be performed in an athletic upright stance, or slightly bent over. It both stretches and contracts the muscles of the lats (latissimus dorsi) as well as providing additional activation to the other upper back muscles and the core. Because the triceps are also isometrically involved in the movement, it is usually performed for higher reps, such as 8-15 reps or more.",
        "BodyPart": "Lats"
    },
    {
        "Title": "UP Rope Push-down",
        "Desc": "The cable rope push-down is a popular exercise targeting the triceps muscles. It's easy to learn and perform, making it a favorite for everyone from beginners to advanced lifters. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Tiger-bend push-up",
        "Desc": "The tiger-bend push-up is an advanced push-up variation where you shift onto your forearms at the bottom position and then back onto your hands and up again. It targets the triceps far more than regular push-ups.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Piriformis SMR",
        "Desc": "Piriformis self-myofascial release (SMR) is a self-administered soft-tissue treatment for the lower body, usually using a foam roller, lacrosse ball, or other \"trigger point\" massage tool. By applying pressure strategically to the piriformis muscles in the upper gluteal region, some people find they can cause this often painful and tight muscle to relax or \"release.\" Piriformis SMR is often accompanied by SMR on the iliotibial (IT) band or tensor fascia lata (TFL muscles), or by stretches that target the glutes and hips.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Arnold press",
        "Desc": "Named after the iconic bodybuilder and movie star, the Arnold press adds rotation to a classic shoulder press. It allows the hands to rotate naturally, while also hitting all three heads of the deltoids in one motion. It is usually performed for moderate to high reps, such as 8-12 reps or more, as part of the upper-body or shoulder-focused portion of a workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Exercise Ball Cable Crunch - Gethin Variation",
        "Desc": "The exercise ball crunch is a popular gym exercise targeting the abdominals. Unlike crunches on the floor or a bench, by using a ball, you can increase the range of motion and both stretch and contract the abs on every rep. The ball crunch can be performed for low reps with a slower tempo, focusing on a hard contraction, or for higher reps.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Single-Arm Cable Row - Gethin Variation",
        "Desc": "The single-arm cable seated row is a version of the cable row movement that train the muscles of the upper back one side at a time. It targets a wide range of muscles including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, as well as the biceps. The single-arm row can work well in a variety of rep-ranges, but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Partner side plank band row",
        "Desc": "The partner side plank band row is an abdominal exercise where two partners perform side planks while pulling on the opposite ends of an exercise band. This technique can be done for time or reps in any ab-focused workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Single-arm dumbbell triceps extension",
        "Desc": "The single-arm dumbbell triceps extension is a popular exercise targeting the triceps one side at a time. It targets all three heads of the triceps, but when performed with the arm overhead, it can be especially effective at building the long head of the triceps. This exercise is usually performed for moderate to high reps, at least 8-12 reps per set, as part of the upper-body or arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Natural Glute Ham Raise",
        "Desc": "The glute ham raise is an exercise targeting the glutes and hamstrings on a GHD.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "TBS Good Morning",
        "Desc": "The barbell good morning is an exercise that targets glute, hamstring, and lower back development. It is often trained as an accessory movement to the deadlift, but also has value on its own. It is sometimes performed for reps in traditional strength-focused rep ranges such as 5-8 reps per set, but due to the risk posed to the lower back, is rarely treated as a max-effort single-rep lift.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "UP Cable Face Pull",
        "Desc": "The standing face pull is an isolation exercise primarily targeting the rear deltoids, traps, and upper back. It is most often performed with a rope attachment.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "One-Arm Cable Crossover - Gethin Variation",
        "Desc": "The single-arm cable cross-over is an isolation movement that uses a cable stack to build bigger and stronger pectoral muscles. Working the chest one side at a time allows you to focus on balance between sides of your chest, and really feel the chest muscles contracting. It is common in upper body and chest-focused muscle-building workouts, often in combination with other presses or flyes to target the chest from different angles.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Hanging exercise ball leg raise",
        "Desc": "The hanging exercise ball leg raise is an exercise targeting the abs and hip flexors. Instead of resting the forearms on the pads of an apparatus, it's performed hanging from a bar with an exercise ball held between the legs.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Incline EZ-bar skullcrusher",
        "Desc": "The incline EZ-bar skullcrusher is a popular exercise targeting the triceps muscles. The incline angle helps to target the long head of the triceps in particular. This exercise is usually performed for moderate to high reps as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Barbell Squat To A Bench",
        "Desc": "The barbell back squat to box takes a classic compound exercise for developing the lower body and adds the box element. Muscles worked include the quads, hips, glutes, and upper hamstrings.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Machine high row",
        "Desc": "The machine high row is a machine-based exercise targeting the back muscles, including the lats, rhomboids, and middle and lower traps. It approximates the motion of a free-weight row, but uses a selectorized weight-stack or plate-loaded machine. Many such machines also allow you to choose between different grips and grip widths. Machine rows are often done for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or back-focused portion of a workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Sumo deadlift",
        "Desc": "The sumo deadlift is a compound movement in which the feet are set in a wide stance with toes pointed out and grip is placed inside of the legs. It is allowed to be performed instead of conventional deadlifts in most powerlifting competitions. The sumo deadlift targets the hamstrings, glutes, and upper back/traps, but also has a greater emphasis on stretching and strengthening the adductor and hip muscles due to the wide stance.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Clapping Push-Up",
        "Desc": "Also known as a plyo push-up, the clapping push-up is a bodyweight exercise aimed at increasing upper-body power and strength. It targets the muscles of the chest, triceps, and shoulders, and can be trained in low reps for power and strength, or higher reps for conditioning.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Sled push-",
        "Desc": "The sled push is a conditioning exercise that targets the cardiovascular system and the muscles of the lower body. It involves pushing a sled along turf or another flat surface either for time or distance. Depending on your type of equipment, you may be pushing handles or straps in front of the sled. It can be used as part of a dynamic warm-up or for power training, as a finisher, or as part of a conditioning workout or circuit.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Seated triceps press",
        "Desc": "The seated triceps press is a popular arm-building exercise that targets the triceps with a single dumbbell held by both hands, extending it up behind your head. While you can go surprisingly heavy on this movement, it is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or arm-focused portion of a workout. If you're going heavy, having someone help get the weight into position is a good idea.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Bent-over scapular slide",
        "Desc": "The bent-over scapular slide is an upper-body exercise that helps with scapular and shoulder mobility. It is commonly performed for time or reps as part of a dynamic warm-up for the upper body.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Plate push",
        "Desc": "The plate push is a conditioning exercise that targets the cardiovascular system and the muscles of the lower body. It involves pushing a plate along turf or another flat surface either for time or distance. It can be used as part of a dynamic warm-up or for power training, as a finisher, or as part of a conditioning workout or circuit.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Kettlebell pirate ship",
        "Desc": "The kettlebell pirate ship is a rotational shoulder and core-focused kettlebell movement. It demands the lifter raise the kettlebell to the side in both directions, emphasizing core strength in the transverse abdominis and obliques in particular. It is best learned with a light weight, using controlled movements in both directions.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Floor rope climb",
        "Desc": "The floor rope climb is an exercise that involves performing partial rope climbs in a prone position with the feet on the floor. It can help prepare someone for full rope climbs, but also trains the muscles of the back, biceps, and grip. It can be done for time or reps.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Close-Grip EZ-Bar Curl - Gethin Variation",
        "Desc": "The close-grip EZ-bar curl is an exercise targeting the biceps, particularly the long head. The main difference between this exercise and standard barbell curls is that the hands are positioned closer together on the bar. It is thought that this helps build the outer biceps head and the peak. This curl variation is usually performed for moderate to high reps, like at least 8-12 reps per set.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Rack Pull - Gethin Variation",
        "Desc": "The rack pull is a variation of the deadlift performed from an elevated height, either using boxes, safety pins, or the safeties in a squat rack. It targets all the same muscles as the deadlift, including the glutes, hamstrings, upper back, lower back, and grip. It can e used to strengthen deadlift lockout, but also as a deadlift alternative for people who can’t deadlift from the floor without pain.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Reverse-grip bent-over row",
        "Desc": "The reverse-grip bent-over row is a compound exercise used to build strength and size in both the lower and upper back. It targets nearly all of the muscles in the back, but particularly the lats, rhomboids, and lower back. It is thought to target the biceps and lats a bit more directly than overhand barbell rows. Because it can be loaded heavily, it is a popular movement in strength and muscle-focused upper-body workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Standing EZ-Bar Curl - Gethin Variation",
        "Desc": "The standing EZ-bar curl is an immenselyp popular exercise targeting the biceps. It is commonly performed for moderate to high reps as part of an upper body or arms-focused workout. Many gyms even have EZ-bars at fixed weights, allowing for easy weight changes.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "King Maker Standing Dumbbell Shoulder Press",
        "Desc": "The standing dumbbell shoulder press is a classic deltoid-builder (especially the front deltoids) that’s ubiquitous in gyms around the world. Performing the move standing up as opposed to seated allows for more weight to be used.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Lying Cable Curl - Gethin Variation",
        "Desc": "The lying cable biceps curl is an isolation exercise that eliminates the possibility of using momentum from the lower body to raise the weight.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Standing Biceps Cable Curl",
        "Desc": "The cable straight-bar biceps curl takes a classic bodybuilding exercise, the standing barbell curl, and replaces the barbell with a handle attached to a cable. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Dumbbell seesaw shoulder press",
        "Desc": "The dumbbell seesaw shoulder press is an exercise targeting the deltoids and triceps. The difference between this movement and the alternating shoulder press is that both dumbbells keep moving throughout each rep, rather than having one weight be stationary while the other moves. This piston-style pressing increases time under tension and may allow you to complete more total reps than with alternating reps.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Arnold press",
        "Desc": "Named after the iconic bodybuilder and movie star, the Arnold press adds rotation to a classic shoulder press. It allows the hands to rotate naturally, while also hitting all three heads of the deltoids in one motion. It is usually performed for moderate to high reps, such as 8-12 reps or more, as part of the upper-body or shoulder-focused portion of a workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Close-stance dumbbell front squat",
        "Desc": "The close-stance dumbbell front squat is a popular exercise for targeting the muscles of the lower body, the quadriceps in particular. Holding dumbbells in the racked position also works the core and upper-back muscles to maintain posture while the lower body moves. Because the amount of weight you can use will be limited by what you can clean to the rack position, this movement is usually performed for moderate to high reps, at least 8-12 reps per set or more. If this movement hurts your knees, try performing it with a wider stance.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Close push-up",
        "Desc": "The close push-up is an upper-body exercise that targets the chest, triceps, and shoulders. The close hand position places more emphasis on the triceps.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Kettlebell pass-through lunge",
        "Desc": "The kettlebell pass-through lunge is a dynamic leg and core exercise in which a lifter passes a weight under their front leg during lunges. It is a unique coordination challenge, but also challenging to the musculature of the abdomen, lower body, shoulders, and upper back. It is most commonly performed for higher reps, such as 10-15 reps per side, or for time. It can work in circuit-style workouts, or in lower-body or full-body time-efficient training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Lunge glute stretch",
        "Desc": "The lunge glute stretch is a lower-body stretch targeting the glutes, hips, and piriformis. It is influenced by the pigeon pose from yoga, but is performed with straight arms. It can be part of a dynamic warm-up or mobility work performed anytime.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Paul Carter Barbell Curl",
        "Desc": "The barbell curl is an arm exercise that is also one of the most recognizable movements in all of bodybuilding and fitness. It helps build sleeve-popping biceps and allows heavier loading than many other curl variations. It is usually performed in moderate to high reps, such as 8-12 reps per set, as part of the arm-focused portion of any workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Close-grip barbell curl",
        "Desc": "The close-grip barbell curl is a curl variation where the hands are closer than shoulder width. It is thought that this helps build the outer biceps head and the peak. This curl variation is usually performed for moderate to high reps, such as 8-12 reps per set.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Cross-body shoulder stretch",
        "Desc": "The cross-body shoulder stretch targets increased flexibility in the shoulders. It is a common inclusion in upper-body dynamic warm-ups prior to training or sports, but can also be performed anytime to \"limber up\" the upper body.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Long sit-up",
        "Desc": "The long sit-up is an advanced version of the sit-up exercise that is performed with the hands reaching over the head. This lengthens the torso, making it harder for the abs to contract and lift the upper body. Long sit-ups can be performed for time or for reps, with the feet anchored or free.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Double-arm triceps kick-back",
        "Desc": "The double-arm triceps kick-back is a popular movement to increase size and strength of the triceps. It is usually performed for moderate to high reps, at least 8-12 reps, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "AM Standing Barbell Curl",
        "Desc": "The standing EZ-bar curl is an immenselyp popular exercise targeting the biceps. It is commonly performed for moderate to high reps as part of an upper body or arms-focused workout. Many gyms even have EZ-bars at fixed weights, allowing for easy weight changes.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Back extension",
        "Desc": "The back extension is an exercise used to build lower back strength that also targets the hamstrings and glutes. It is often performed on a 45-degree bench with the feet anchored. Unweighted back extensions are often performed for high reps, such as 15-20 reps or more, but the movement can also be performed with added weight in lower rep ranges, such as 8-12 reps per set.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Shoulder extension stretch",
        "Desc": "The shoulder extension stretch is focused on bringing more flexibility to the shoulder joint. It increases range of motion in shoulder extension, or moving the arms behind the back. It can be performed as part of a warm-up or mobility and flexibility work post-workout or anytime.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Power clean",
        "Desc": "The power clean is a full-body movement in which the bar is pulled from the floor and caught in the front rack position in three pulls or phases. The bar is received in the \"power\" position, with the hips higher than a full-depth squat position. The power clean can be used as a component of the clean and press or clean and jerk, but is also a valuable lift to build explosive power and strength.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "AM Close-Grip Pull-Down",
        "Desc": "The close-grip pull-down is a variation on the lat pull-down, acable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Standing Barbell Press Behind Neck",
        "Desc": "The standing behind-the-head press is a classic shoulder exercise that was used widely during bodybuilding's professed Golden Era. In addition to the deltoids, it also works the trapezius and triceps muscles. It may not be a good choice for some people's shoulders, depending on their injury history. It can be trained in strength-focused rep ranges, but is more commonly trained in moderate to high reps, such as 8-15 reps per set.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Band bent-over row",
        "Desc": "The band bent-over row is an exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lat), lower trapezius, and rear deltoids. Bands provide dynamic resistance and can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Decline bar press sit-up",
        "Desc": "The decline bar press sit-up is a weighted core exercise targeting the abdominal muscles, particularly the lower abs. It also challenges the shoulders and upper back to move the weight. Weighted sit-up variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the core-focused portion of a workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Seated dumbbell biceps curl",
        "Desc": "The seated dumbbell biceps curl is a popular exercise for building bigger biceps. While curls can effectively be performed standing as well, performing them seated can enforce strict form and perhaps boost the mind-muscle connection. Like most curl variations, these are usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Incline cable chest fly",
        "Desc": "The incline cable chest fly is an isolation movement that uses a cable stack and an incline bench to target the upper portion of the pectoral muscles. It is common in upper-body and chest-focused muscle-building workouts, often after pressing movements like the barbell or dumbbell bench press or as a finishing movement at the end of the workout. It is often used in combination with other flyes to target the chest from different angles.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Lying cable lateral raise",
        "Desc": "The lying cable lateral raise is an isolation exercise that targets the medial or middle deltoid muscle of the shoulders. It is most common in muscle-building shoulder or upper-body workouts, usually in higher rep ranges of at least 8-12 reps per set.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "AM Single Arm Row",
        "Desc": "The single-arm bench dumbbell row is a popular exercise for building the latissimus dorsi, or lat, muscles of the back. The bench is used for support during the rowing motion.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "EZ-bar skullcrusher-",
        "Desc": "The EZ-bar skullcrusher is a popular exercise targeting the triceps muscles. Contrary to what the name implies, the bar should actually come down behind the head. It is usually performed for moderate to high reps as part of an upper-body or arms-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Reverse-grip dumbbell curl",
        "Desc": "With the reverse-grip dumbbell curl, the palms face down, not up. This unorthodox wrist position simultaneously targets the biceps while also building forearm and grip strength. The move can be performed standing or seated. Because grip is a limiting factor, it is usually performed for moderate to high reps, such as 8-10 reps per set.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Rack pull",
        "Desc": "The rack pull is a variation of the deadlift performed from an elevated height, either using boxes, safety pins, or the safeties in a squat rack. It targets all the same muscles as the deadlift, including the glutes, hamstrings, upper back, lower back, and grip. It can be used to strengthen deadlift lockout, but also as a deadlift alternative for people who can't deadlift from the floor without pain.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Child's pose",
        "Desc": "Child’s pose is a traditional yoga pose that is also popular in fitness and strength training. It targets mobility of the thoracic spine and control of the vertebral column. It can be performed for time or reps as part of a dynamic warm-up or as a mobility or restorative exercise anytime. It can also work as part of a yoga or bodyweight sequence with other poses.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Iron cross stretch",
        "Desc": "The iron cross stretch is a bodyweight stretch that focuses on hip and thoracic spine mobility.",
        "BodyPart": "Lats"
    },
    {
        "Title": "King Maker Barbell Back Squat",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Step-up with knee raise",
        "Desc": "The step-up with knee raise is a lower-body exercise targeting the quads, glutes, and hamstrings. It differs from a traditional step-up in that at the top, you lift the trailing leg up to full hip flexion. This gives the exercise a greater range of motion and more of a focus on powerful hip extension in the working leg. When performed with body weight, these are usually performed for high reps as part of a dynamic warm-up, as cardio acceleration, or as part of the lower-body portion of a workout or circuit.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Decline dumbbell chest fly",
        "Desc": "The decline dumbbell chest fly is an upper-body exercise targeting the muscles of the chest, particularly the lower chest. It will require less weight than a decline press, which makes it a great hypertrophy exercise with high reps. Fly variations are usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "UP Triceps Extension Straight-Bar Push-Down",
        "Desc": "The cable straight-bar push-down is a popular gym exercise for targeting the triceps. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Standing EZ-bar curl",
        "Desc": "The standing EZ-bar curl is a popular exercise targeting the biceps. It is commonly performed for moderate to high reps as part of an upper-body or arm-focused workout. Many gyms even have EZ-bars at fixed weights, allowing for easy weight changes.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Seated triceps push-down",
        "Desc": "The seated triceps push-down is a triceps exercise that is performed with a rope attachment. The seated position helps eliminate the use of momentum. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Upside-down pull-up",
        "Desc": "The upside-down pull-up is an advanced bodyweight exercise that is normally performed on a pair of gymnastic rings. It involves pulling the body toward the ceiling in an inverted position. It targets the same muscles as traditional pull-ups, including the lats (latissimus dorsi), biceps, and core. However, the pulling angle is more akin to a bent-over row or upright row, depending on the angle of your hips.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Stiff-Legged Dumbbell Deadlift - Gethin Variation",
        "Desc": "The dumbbell stiff-legged deadlift targets the hamstrings, glutes, low and upper back, as well as the core. The purpose of the stiff-legged, as opposed to Romanian deadlift with slightly bent knees, is to engage the hamstrings and low back to an even greater degree.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Smith machine lunge sprint",
        "Desc": "The Smith machine lunge sprint is a lower-body power exercise performed with the bar of a Smith machine on the back. It is similar to an alternating jump lunge or \"scissor lunge,\" but with added weight. The contained bar of the Smith machine makes it safer and less of a balance challenge than using a free weight.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Floor angel",
        "Desc": "The floor angel is a stretch targeting shoulder mobility and activation of the shoulder stabilizer muscles. It also targets a range of postural muscles in the upper back.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Alternating standing glute stretch",
        "Desc": "The alternating standing glute stretch focuses on improving lower-body mobility and flexibility, particularly in the hips and glutes. It involves performing a partial squat in a \"figure 4\" position. It can be performed as part of a lower-body warm-up or done post-workout to help combat tightness and soreness.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Crunch - Gethin Variation",
        "Desc": "The crunch is a popular core exercise targeting the rectus abdominis, or \"six-pack\" muscles, as well as the obliques. It has been the centerpiece of many ab-focused workouts, due to both its simplicity and the intense burn and mind-muscle connection it produces. It can be performed for time or reps as part of the ab-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "EZ-bar preacher curl",
        "Desc": "The EZ-bar preacher curl is a classic exercise for building bigger biceps. This move is all about isolation. With the back of the upper arms against the pad, it's next to impossible to use momentum which forces the muscles to work harder.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Incline dumbbell biceps curl",
        "Desc": "The incline dumbbell biceps curl is an exercise targeting the biceps and performed face up on an incline bench. This creates a vertical arm angle, which helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Dumbbell Crunch - Gethin Variation",
        "Desc": "The dumbbell crunch is a more difficult version of a highly popular abdominal movement. The simple addition of a weight makes the crunch far more difficult, providing a different stimulus to the core during training.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Neutral-grip pull-up",
        "Desc": "The neutral-grip pull-up is a multijoint bodyweight exercise in which the reps are performed with the palms facing one another. Like other pull-up variations, it builds strength and muscle in the upper back, biceps, and core. It can be used as a more shoulder-friendly alternative to straight-bar pull-ups, or to help perform more reps than you can perform overhand.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Single-arm dumbbell crunch",
        "Desc": "The single-arm dumbbell crunch is a more difficult version of a highly popular abdominal movement. Adding a weight to one side makes the crunch far more difficult to your rectus abdominis or \"six-pack\" muscles, as well as the obliques and deep core muscles.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Behind-The-Neck Pull-Down - Gethin Variation",
        "Desc": "The behind-the-neck pull-down is a cable exercise intended to target the muscles of the upper and middle back. If you have the requisite shoulder mobility, it can help you targets the upper back muscles, including the trapezius and rhomboids, as well as the lats (latissimus dorsi). It is popular among elite bodybuilders and physique athletes, but some coaches consider it unsafe to the shoulder joint, in particular to people with existing shoulder problems.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Side Lateral Raise",
        "Desc": "The dumbbell lateral raise is an upper body isolation exercise for building shoulder strength and muscle. It's a staple strength training move and is a great option for accessory work on upper body training days. This exercise particularly focuses on the lateral or medial head of the deltoid, making them appear wider and more developed.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Knee Tuck Jump",
        "Desc": "The tuck jump is a vertical jump, an explosive lower-body exercise that is a common way to measure explosive hip and lower-body strength in athletes. The more explosive you are, the higher you'll be able to jump.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "AM Pec Dec",
        "Desc": "The pec deck is a machine-based exercise targeting the chest. It approximates the motion of a dumbbell fly or cable fly, but is usually performed facing forward and seated upright. The motion is often compared to bear-hugging a tree trunk. The chest fly is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a pre-exhaust or muscle-building upper-body workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Reverse-Grip Cable Triceps Pushdown - Gethin Variation",
        "Desc": "The reverse-grip cable straight-bar push-down is a twist on the popular cable straight-bar push-down. The difference has to do with how the hands are positioned holding the bar: the palms facing up rather than down. Because grip will be a limiting factor, this movement is usually performed for moderate to high reps, such as 8-12 reps per set or higher.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Assist machine triceps push-down",
        "Desc": "The assist machine triceps push-down is a triceps-focused exercise that is performed on an assisted pull-up or dip station. It is performed by pressing downward on the knee pad of the machine, against the resistance of the weight. It approximates the motion of a triceps cable rope push-down, but with open hands. This variation is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Wide-grip bench press",
        "Desc": "The wide-grip bench press is a compound exercise targeting the chest and, to a lesser extent, the triceps. The main difference between this exercise and the standard bench press is that the hands are placed farther apart on the bar. Many lifters find they can handle more weight going wide than with narrower grips, although it's also worth noting that plenty of banged-up lifters have said benching with a wide grip may also have contributed to their shoulder injuries and pain. The wide-grip bench is often used as a chest-building movement in chest or upper-body workouts, or as an accessory movement for the traditional bench press.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Medicine ball rotational throw",
        "Desc": "The medicine ball rotational throw is an explosive exercise targeting the abdominals, including the obliques, as well as the hips and upper back. It involves standing sideways to the wall and twisting the torso to hurl a medicine ball into the wall, then catching the ball on the ricochet. It can be performed for lower reps with a focus on power, or for higher reps with a focus on fat loss and conditioning.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Hex Bar Deadlift - Gethin Variation",
        "Desc": "The hex bar deadlift is a variety of deadlift performed in a hexagonal barbell also known as a trap bar. The bar is held with a parallel (palms in) grip outside of the legs. It is biomechanically different from a barbell deadlift in that it lines up with a lifter’s center of gravity, rather than placing it in front of their body. The trap bar deadlift can be trained in traditional strength and muscle-focused rep range, or for higher reps. It activates all of the same muscle groups as conventional or sumo deadlifts, including the glutes, quads, hamstring, lower back, lats, upper back, and grip.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "TBS Bent-Over Dumbbell Row",
        "Desc": "The dumbbell bent-over row is a popular exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lat), lower trapezius, and rear deltoids. It can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Dumbbell row to triceps kick-back",
        "Desc": "The dumbbell row to triceps kick-back is a dumbbell complex that combines two movements that collectively target the muscles of the lats (latissimus dorsi), upper back, and triceps. It also isometrically targets the core, hamstrings, and glutes. It is usually performed one rep of each movement at a time, although you could perform more reps of each, or increase the reps in successive rounds (e.g., 1 rep in round 1, 2 reps in round 2, etc.). No matter how you structure the sets and reps, it is a time-efficient way to hit two crucial upper-body muscles in any workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Single-arm cable triceps extension",
        "Desc": "The single-arm cable triceps extension is a single-joint isolation exercise for building the triceps. It involves driving a handle attached to a cable stack overhead to full extension. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Treadmill walking",
        "Desc": "Treadmill walking is a popular cardiovascular exercise performed on a machine that is available in most gyms. Performing this exercise on a treadmill allows you to adjust the speed of your walking and, depending on the machine, perform it on an adjustable incline. Many machines also have built-in heart rate monitors and timers to help you track your progress.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "FYR Kneeling Biceps",
        "Desc": "The kneeling concentration curl allows you to target the biceps without having the ability to use momentum from the rest of your body to move the weight.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Standing barbell overhead triceps extension",
        "Desc": "The standing barbell overhead triceps extension is an isolation movement targeting the triceps. The overhead position targets the long head of the triceps in particular. This movement is generally performed for moderate to high reps as part of the arms-focused portion of a workout. If holding a straight bar bothers the wrists or elbows, it can alternately be performed with an EZ-bar or neutral-grip bar.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Wide-Grip Lat Pull-Down - Gethin Variation",
        "Desc": "The lat pull-down is a cable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "FYR Dumbbell Thruster",
        "Desc": "The dumbbell thruster, which begins with a squat and ends with an overhead press, works the entire body at once in a single fluid motion. This exercise is often performed with kettlebells, but dumbbells work great, too.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Dumbbell Alternate Bicep Curl",
        "Desc": "The alternating biceps curl is a single-joint exercise for building bigger and stronger biceps one arm at a time. Popular among gym goers of all experience levels, this move can be done seated or standing. It is generally performed for moderate to high reps, such as 8-12 reps or higher, as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Brachialis SMR",
        "Desc": "Brachialis self-myofascial release (SMR) is a self-administered soft-tissue treatment for the upper body, usually using a foam roller, lacrosse ball, or other \"trigger point\" massage tool. By applying pressure strategically to the biceps or brachialis muscles of the upper arm, some people find they can cause this often painful and tight muscle to relax or \"release.\" Brachialis SMR is often accompanied by SMR on the triceps muscles or pectorals, or by stretches that target the biceps or pecs.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Broad jump",
        "Desc": "The broad jump is an explosive lower-body exercise. It is a common way to measure explosive hip and lower-body strength in athletes. The more explosive you are, the farther you'll be able to jump.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "UP Squat",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-Leg Squat With Knee Tap",
        "Desc": "The single-leg knee-tap squat is a single-leg squat variation that involves “floating” the back leg over the ground on the descent until touching just the knee to the ground or a pad. It is similar to a lunge, but without touching the back foot to the ground. It is an intense strength and coordination challenge that can work in any strength- or athleticism-focused workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Staggered-stance band shoulder press",
        "Desc": "The staggered-stance band shoulder press is a deltoid exercise and a variation of the band shoulder press. The dynamic tension of the band forces the core to stabilize the body, and the staggered-stance provides more stability and relieves tension on the back. It can be performed in low reps, such as 5-8 reps per set, to build shoulder strength, or for higher reps to build muscle and for conditioning. It can work as the main focus of a shoulder day but is also popular as an accessory movement to the bench press or barbell military press.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Seal jack",
        "Desc": "The seal jack is a variation on the jumping jack, one the most common calisthenic exercises on the planet. The difference between this movement and the jumping jack has to do with the arm motion. Instead of the arms coming together overhead, they come together in front of the body, like a seal clapping its fins.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Exercise ball roll-out",
        "Desc": "The exercise ball roll-out is an exercise that strengthens the core, shoulders and upper- back muscles. It starts in a plank-style position, with the arms resting on a ball. Then, roll the ball out in front of you as far as you can while maintaining a strong, neutral spinal position. The lack of stability from the ball increases the degree of difficulty. This is a difficult movement, and beginners may need to use a limited range of motion.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Reverse Barbell Preacher Curls",
        "Desc": "The reverse-grip barbell curl is a variation on the biceps curl where the palms face downward. The switch from an underhand to an overhand grip brings the forearm and brachialis muscles more into the exercise. If it is uncomfortable to the wrists, try performing it on the angles of an EZ-curl bar.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Hamstring slide",
        "Desc": "The hamstring slide is a bodyweight exercise targeting the hamstrings. Lying supine on a smooth surface, bend your knees to pull both heels toward you. The sliding action requires a pad, cloth, or furniture sliders under the heels. These are considered more difficult than exercise ball hamstring curls and are a great primer movement before heavy squats or deadlifts, or as an accessory movement later in a lower-body workout.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Dumbbells-together incline bench press",
        "Desc": "The dumbbells-together incline bench press is an exercise targeting the pectoral muscles, particularly the upper pecs. Squeezing the dumbbells together forces the chest muscles to work hard during the entire press. This press variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Hanging Leg Raise - Variation Gethin",
        "Desc": "The hanging leg raise is an exercise targeting the abs and hip flexors. Instead of resting the forearms on the pads of apparatus, hang from a bar. It can be performed for time or reps in the ab-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Romanian Deadlift",
        "Desc": "The barbell stiff-legged deadlift targets the hamstrings, glutes, lower and upper back, as well as the core. It is a popular accessory movement for the deadlift, but also a muscle-building hamstring movement.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "King Maker Burpee",
        "Desc": "The burpee is a high-intensity exercise that recruits the entire body to build strength and aerobic capacity. It is common in CrossFit workouts and group fitness classes, but can also be performed for time or reps in any fat-loss or athleticism-focused circuit or workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm landmine push-press",
        "Desc": "The single-arm landmine push-press is an explosive upper-body exercise that uses an angled barbell anchored at floor level in a landmine device. It can also be performed by sticking a barbell in the corner of a room, preferably in a towel to protect the walls. The angle of a landmine press is usually somewhere between an incline press and a military press, and the movement focuses primarily on the muscles of the shoulders or deltoids. It can be trained in traditional muscle and strength-focused rep ranges or for higher reps.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Machine chest press",
        "Desc": "The machine chest press is a machine-based exercise targeting the chest. It approximates the motion of a bench press but is usually performed facing forward and seated upright. Many machines offer multiple grip options, such as overhand, neutral (palms facing), or underhand. The chest press is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a pre-exhaust or muscle-building upper-body workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Cable V-bar push-down",
        "Desc": "The cable V-bar push-down is a popular gym exercise for targeting the triceps. It utilizes an angled bar, which can allow you to move heavier weights more comfortably than a straight bar or rope. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Alternating dumbbell front raise",
        "Desc": "The alternating dumbbell front raise is a single-joint exercise targeting the shoulder muscles, particularly the front or anterior deltoids. Performing the movement one shoulder at a time gives a momentary rest to each side while the other is working, potentially allowing you to do more reps during each set. It is usually performed for moderate to high reps, at least 8-12 reps per set, as part of an upper-body or shoulder-focused workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Dumbbell Bicep Curl",
        "Desc": "The dumbbell biceps curl is a single-joint exercise for building bigger and stronger biceps. Popular among gym goers of all experience levels, this move can be done seated or standing. It is generally performed for moderate to high reps, such as 8-12 reps or higher, as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "TBS Incline Dumbbell Curl",
        "Desc": "The incline dumbbell biceps curl is an isolation exercise targeting the biceps. This variation targets the long head of the biceps more than a traditional curl and there is more overall tension to this muscle.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Single Arm Overhead Kettlebell Squat",
        "Desc": "The single-arm kettlebell overhead squat is a popular kettlebell movement performed while holding a single kettlebell in a locked-out overhead position. It targets the muscles of the lower body dynamically, while also challenging and building shoulder stability and upper-back mobility. It can be trained in traditional strength or muscle-building rep ranges, in circuit or fat-loss training, or as part of a kettlebell combination or complex.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Lower back SMR",
        "Desc": "Lower back self-myofascial release (SMR) is a self-administered soft-tissue treatment, usually using a foam roller, lacrosse ball, or other \"trigger point\" massage tool. By applying pressure strategically to the quadratus lumborum or spinal erector (erector spinae) muscles of the lower back, some people find they can cause this often painful and tight area to relax or \"release.\" Lower back SMR is often accompanied by SMR on the glutes or piriformis muscles, or by stretches that target the piriformis or hips. However, some people find that SMR on the lower back can aggravate existing pain or injury, so be cautious when performing it.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Single-leg glute bridge",
        "Desc": "The single-leg glute bridge is a lower-body exercise that targets the glutes, lower back, and hamstrings. It is performed one side at a time.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Single-arm dumbbell preacher curl",
        "Desc": "The single-arm dumbbell preacher curl is an exercise that focuses on building the biceps, particularly the biceps peak. Most people will go light on this movement, performing it for moderate to high reps as part of an upper-body or arms-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Standing Bent-Over One-Arm Dumbbell Triceps Extension",
        "Desc": "The single-arm triceps kick-back is an isolation move from a bent-over position used to increase size and strength of the triceps.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Exercise ball weighted hyperextension",
        "Desc": "The exercise ball weighted hyperextension is an exercise that strengthens the lower back. If balance is an issue, have someone hold your feet.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Barbell Deadlift Bent Row Complex",
        "Desc": "The barbell deadlift bent-over row complex combines two movements to target the posterior chain. It requires using a lighter weight than you could handle for heavy deadlifts alone, but doubles down on activation in the upper back, lower back, and glutes.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Cable Triceps Extension - Gethin Variation",
        "Desc": "The cable rope push-down is a popular exercise targeting the triceps muscles. It's easy to learn and perform, making it a favorite for everyone from beginners to advanced lifters. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.The cable rope push-down is a popular exercise targeting the triceps muscles. It's easy to learn and perform, making it a favorite for everyone from beginners to advanced lifters. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Kettlebell front rack lunge",
        "Desc": "The kettlebell front rack lunge is a dynamic leg and core exercise in which a lifter performs lunges while holding a single kettlebell in the front-racked position. It is a unique coordination challenge, but also challenging to the musculature of the abdomen, lower body, shoulders, and upper back. It is most commonly performed for higher reps, such as 10-15 reps per side, or for time. It can work in circuit-style workouts, as well as in muscle or strength-focused workouts.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm banded landmine press",
        "Desc": "The single-arm banded landmine press is an upper-body exercise that uses an angled barbell anchored at floor level in a landmine device. It can also be performed by sticking a barbell in the corner of a room, preferably in a towel to protect the walls. The band adds constant tension and dynamic resistance to the exercise. The movement focuses primarily on the muscles of the shoulders or deltoids and can be trained in traditional muscle and strength-focused rep ranges or for higher reps.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Alternating biceps curl",
        "Desc": "The alternating biceps curl is a single-joint exercise for building bigger and stronger biceps one arm at a time. Popular among gym goers of all experience levels, this move can be done seated or standing. It is generally performed for moderate to high reps, such as 8-12 reps or higher, as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Reverse-grip incline dumbbell bench press",
        "Desc": "The reverse-grip incline dumbbell bench press is an upper-body exercise targeting the pectoral muscles. Pressing with a reverse grip targets the upper chest in particular, especially when performed on an incline. This press variation is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Exercise ball leg curl",
        "Desc": "The exercise ball leg curl is an exercise targeting the hamstrings. In particular, it targets the knee flexion function of the hamstrings, as opposed to deadlift variations, which target the other hamstring function, hip flexion. Many lifters opt for this exercise when they don't have access to a lying leg curl machine, but it is worth considering even if you already do machine curls.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Dumbbell jump squat with rotation",
        "Desc": "The dumbbell jump squat with rotation is a popular movement combining an explosive lower-body movement with extra upper-body loading in the form of dumbbells held in the hands. Each jump ends with the body turned 90 degrees, adding a rotational power component to the lift. It is usually performed with light weights for high reps in fat-loss and conditioning workouts.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Dumbbell external shoulder rotation",
        "Desc": "The dumbbell external shoulder rotation is a lightweight dumbbell exercise intended to maintain the health of the shoulder joints, including the rotator cuffs. It is often used as a warm-up or prehab for a shoulder or chest-focused workout with lots of pressing.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Dumbbell Lying Rear Lateral Raise",
        "Desc": "The incline dumbbell reverse fly is an upper-body exercise targeting the posterior or rear deltoids, as well as the postural muscles of the upper back. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Smith machine end-grip shoulder press",
        "Desc": "The Smith machine end-grip shoulder press is a machine-based exercise targeting the shoulder muscles. It is performed holding the end of the bar in the Smith machine on the outside of the rack. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or shoulder-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Single-arm incline rear delt raise",
        "Desc": "The single-arm incline rear delt raise is an upper-body exercise targeting the posterior deltoids or shoulder muscles, as well as the postural muscles of the upper back. Training each side independently can help correct imbalances in size, strength, and shoulder stability. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Paul Carter Incline Dumbbell Biceps Curl",
        "Desc": "The incline dumbbell biceps curl is an isolation exercise targeting the biceps. This variation targets the long head of the biceps more than a traditional curl and there is more overall tension to this muscle.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Single-leg stiff-legged deadlift to row",
        "Desc": "The single-leg stiff-legged deadlift to row takes two popular strength moves and combines them into one full-body blaster. Between the deadlift and the row, you'll target the glutes, hamstrings, quads, back, and biceps. Because balance can be a challenge, this movement is usually done with relatively light weights for high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Barbell front squat",
        "Desc": "The barbell front squat is a compound movement that emphasizes building the lower-body muscle groups. With the barbell racked in front of the body on the anterior delts, the front squat emphasizes the quads and glutes, but also upper back and core strength to remain upright. Front squats can be trained as an alternative to back squats, as an accessory movement for either squats or deadlifts, or for strength and muscle on their own. Many lifters and athletes prefer them to back squats, although they can be uncomfortable and difficult to learn at first.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Overhead Machine Triceps Extension - Gethin Variation",
        "Desc": "The machine triceps extension is an isolation exercise targeting the tricep muscles.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Typewriter push-up",
        "Desc": "The typewriter push-up is an advanced push-up variation where the hands are extra wide and you lower toward each hand in alternating reps. It is more challenging to each working arm than traditional push-ups and also stretches and challenges the chest.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Dumbbell kickstand deadlift",
        "Desc": "The dumbbell kickstand deadlift is a movement targeting the muscles of the hamstrings, glutes, and back. The kickstand position can help focus the stretch and contraction on each individual leg, similar to a single-leg Romanian deadlift, while presenting less of a balance challenge. It can be performed in low reps, such as 5-8 reps per set, for strengthening the posterior chain, or for higher reps for muscle growth.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Barbell front squat to back squat",
        "Desc": "The barbell front squat to back squat is a complex that combines two fundamental barbell squat movements with a press in between to build overall strength, coordination, and endurance. This combo hits every muscle in the lower body, but also seriously challenges the upper-body musculature to control and transition the weight.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Plate lateral raise",
        "Desc": "The plate lateral raise is an exercise targeting the side heads of the shoulder muscles or deltoids. It closely resembles the more popular dumbbell lateral raise, but is performed with light plates, making the movement slightly more difficult. It is usually performed for moderate to high reps as part of a shoulder or upper-body workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Seated rear delt fly",
        "Desc": "The seated rear delt fly is an upper-body exercise that targets the real deltoid of the shoulder. By performing the movement seated, it eliminates momentum from the rest of the body. This movement is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or shoulder-focused portion of a workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Incline cable straight-bar triceps extension",
        "Desc": "The incline cable straight-bar triceps extension is a single-joint arm exercise performed on an incline bench. This incline position offers a great stretch and range of motion, potentially targeting the long head of the triceps more than some other triceps exercises. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Vertical jump",
        "Desc": "The vertical jump is an explosive lower-body exercise that is a common way to measure explosive hip and lower-body strength in athletes. The more explosive you are, the higher you'll be able to jump.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Single-arm standing shoulder press",
        "Desc": "The single-arm standing shoulder press is a popular exercise to build size and strength the shoulders and triceps. Most lifters find they can go heavier (per arm) on this movement than if they are pressing two dumbbells simultaneously, making it an effective strength movement as well as a muscle-building movement in higher reps.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Barbell forward lunge",
        "Desc": "The barbell forward lunge is a popular lower-body exercise targeting the quads, glutes, and hamstrings. Using a barbell allows you to overload the exercise beyond body weight and perform the movement in strength or muscle-focused rep ranges. The forward lunge can be performed as part of a barbell complex, in a circuit, or on its own in the lower-body portion of any workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Lying Close-Grip Bar Curl On High Pulley - Gethin Variation",
        "Desc": "The lying high-cable biceps curl is an unusual move for building the biceps—but it’s a highly effective one. Lying prone and curling down toward you provides a different stimulus than more standard approaches allow.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "ACFT Low-handle trap bar deadlift",
        "Desc": "The low-handle trap bar deadlift is a variety of deadlift performed in a hexagonal barbell also known as a trap bar. This specific exercise is part of the new Army Combat Fitness Test or ACFT. The bar is held with a parallel (palms in) grip outside of the legs. It is biomechanically different from a barbell deadlift in that it lines up with a lifter's center of gravity, rather than placing the weight in front of their body. It activates all of the same muscle groups as conventional or sumo deadlifts, including the glutes, quads, hamstrings, lower back, lats, upper back, and grip.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Total Fitness Weighted Push-Up",
        "Desc": "The plate-weighted push-up is a simple way to make a classic bodyweight exercise more difficult. It targets all the same muscles as the push-up: chest, triceps, shoulders, upper back, and core. You can balance a plate on your upper back yourself, but it's easier and safer to have someone else put it there. If you stack a few plates up, be sure to have a spotter close at hand.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Partner Flat-Bench Back Extension",
        "Desc": "The partner bench back extensionis a clever way to perform this exercise, which works the spinal erectors in the lower back. There are machines and angled apparatus that allow this exercise to performed solo; but, lacking those, all you need is a bench and a workout partner.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Single-arm low cable triceps extension",
        "Desc": "The single-arm low cable triceps extension is a single-joint isolation exercise for building the triceps. It involves driving a handle attached to a cable stack overhead to full extension. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Scapular push-up",
        "Desc": "The scapular push-up is an upper-body exercise aimed at increasing the stability of the scapulae and mobility in the shoulders. It is often performed as part of a dynamic warm-up before an upper-body workout, or as part of a mobility session.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Paul Carter Barbell Split Squat",
        "Desc": "The barbell Bulgarian split squat is a single-leg, full-body exercise targeting the quads, glutes, and hamstrings. It is easier to overload with the barbell as opposed to using dumbbells.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Medicine ball duck walk",
        "Desc": "The medicine ball duck walk is a dynamic medicine ball movement that challenges both the upper and lower body, while also elevating the heart rate. It's a great movement to include in medicine ball or bodyweight circuit training to increase fatigue and burn serious calories while hammering the muscles of the legs.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Barbell glute bridge",
        "Desc": "The barbell glute bridge is a popular exercise targeting the muscles of the glutes and hamstrings. It can be done as a strength movement on its own, as an activation drill or warm-up for lower-body training, or as a burnout at the end of a lower-body workout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "UP Cable Straight-Arm Pull-Down",
        "Desc": "The straight-arm rope pull-down is a variation of the straight-arm lat pull-down performed using a cable stack machine and a rope grip. It can either be performed in an athletic upright stance, or slightly bent-over. It both stretches and contracts the muscles of the lats (latissimus dorsi) as well as providing additional activation to the other upper back muscles and the core. Because the triceps are also isometrically involved in the movement, it is usually performed for higher reps, like 8-15 reps or above.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Lying rear delt Y",
        "Desc": "The lying rear delt Y works the shoulders, specifically the rear heads, as well as the lower trapezius muscles. At the top of the motion, the arms and torso form a Y—hence the name. Shoulder Y variations are usually performed with light weights as a warm-up or prehab movement for upper-body training, or as a burnout on shoulder day.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Walking lunge",
        "Desc": "The walking lunge is a lower-body exercise that targets the glutes, quads, and hamstrings while challenging stability and balance. It can be performed for reps, time, or distance in the lower-body portion of any workout.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Lying glute stretch",
        "Desc": "The lying glute stretch is a stretch to help increase flexibility in the glutes and hips. It involves rotating a single leg over the body while lying flat on the back, and reaching around the leg to facilitate a stretch. It is commonly included in dynamic warm-ups or cool-downs, but can also be performed as full-body mobility work anytime.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Warrior push-up",
        "Desc": "The warrior push-up is a series of push-up and plank variations combined into a single sequence. They include a Judo push-up, plank, side plank, mountain climber, diamond push-up, and regular push-up. Done together, they tax the upper-body muscles from different angles and increase time under tension for the entire body.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Rope overhead triceps extension",
        "Desc": "The rope overhead triceps extension is a single-joint exercise focused on the triceps that uses a cable stack with a rope handle. The overhead position targets the long head of the triceps in particular. Many lifters save this move for last in their triceps workout, performing it for moderate to high reps, such as 8-12 reps or more per set.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Neutral-grip lat pull-down",
        "Desc": "The neutral-grip lat pull-down is a variation on the lat pull-down that uses a handle with a neutral (palms facing in) grip. This arrangement helps to build lat width and target the upper lats. This movement is usually performed for moderate to high reps, such as 8-12 per set or higher, as part of an upper-body or back-focused workout.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Decline Barbell Triceps Extension - Gethin Variation",
        "Desc": "The decline EZ-bar skullcrusher is an upper body isolation exercise targeting the triceps.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Superman-",
        "Desc": "The Superman is a bodyweight exercise that consists of isometric holds in an extended spine position. It targets the muscles of the posterior chain, including the muscles of the glutes, spinal erectors, and upper back. It can be performed as part of a dynamic warm-up, or for muscle activation or mobility anytime.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "BFR cable rope hammer curl",
        "Desc": "The blood flow restriction (BFR) cable rope hammer curl is an arm movement that builds biceps size and strength using a cable stack, rope grip, and blood flow restriction bands. It is popular in high-rep \"pump\"-style arm workouts. The bands should be placed as high as possible on your arms, at a tightness of no greater than 8 on a scale of 10. Most BFR workouts recommend using a far lighter weight than usual, perhaps as low as 25-50 percent of a normal working weight.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "FYR Rope Jumping",
        "Desc": "Jumping rope is classic conditioning exercise that is popular with everyone from children to boxers to CrossFit athletes. It targets many different muscles, including the calves, glutes, shoulders, and upper back, and is great for everything from fat loss to improving overall athletic performance.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "King Maker Lat Pull-Down",
        "Desc": "The lat pull-down is a cable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Barbell forehead curl",
        "Desc": "The barbell forehead curl is a classic movement from the Golden Age of bodybuilding and is often associated with Dave \"The Blond Bomber\" Draper. The barbell is brought up to your forehead instead of to your chest, emphasizing the squeeze and peak contraction. It is usually performed for moderate to high reps, such as 8-12 reps per set.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Incline dumbbell row",
        "Desc": "The incline dumbbell row is an upper-body exercise targeting the lats (latissimus dorsi) and upper-back muscles, as well as the biceps. Performing it on an incline bench helps target the lower lats in particular. Dumbbell row variations are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of the upper-body or back-focused portion of a workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Single-arm band kick-back",
        "Desc": "The single-arm band kick-back is an isolation exercise that targets the triceps. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Dumbbell skullcrusher",
        "Desc": "The dumbbell skullcrusher is a triceps exercise that has been a staple of bodybuilders for decades. Skullcrushers are usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Decline kayak",
        "Desc": "The decline kayak is a core exercise targeting the obliques. It involves making a paddling motion on a decline bench with the feet anchored, using a bar or pipe for weight. It is usually performed for moderate to high reps, at least 8-12 reps per side, as part of the ab-focused portion of a workout or circuit.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Pull-up",
        "Desc": "The pull-up is a multijoint bodyweight exercise that builds strength and muscle in the upper back, biceps, and core. It is often used as a measurement tool in military or tactical fitness tests, and is an excellent gauge of \"relative strength\" which is strength in relation to body weight.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Inchworm",
        "Desc": "The inchworm is a popular bodyweight exercise that involves “walking” the hands on the floor from a bent-over toe-touch position into a straight-arm plank. It is usually performed as part of a dynamic warm-up to help raise core body temperature and “limber up” the body from head to toe.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Pigeon stretch",
        "Desc": "The pigeon stretch is a lower-body stretch targeting the glutes, hips, and piriformis. It is similar to the pigeon pose from yoga, but is also popular as part of dynamic warm-ups or cool-downs in strength training. It can also be performed anytime to help combat training-related soreness.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Rower",
        "Desc": "The rower is a popular gym machine that is serious cardiovascular work, but also targets the legs, back, and arm muscles. It's a great way build overall aerobic and muscular fitness. It is popular in CrossFit-style workouts, but is also a staple in all types of gyms. It can be equally effective for HIIT-style interval workouts or for longer-duration endurance work.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "UP Seated Cable Row",
        "Desc": "The cable seated row is a popular exercise to train the muscles of the upper back, including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, using a cable stack. It also targets the biceps to a lesser degree. The cable row can work well in a variety of rep-ranges, but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Paul Carter Overhead Rope Triceps Extension",
        "Desc": "The rope overhead triceps extension is a single-joint exercise focused on the triceps and using a cable stack with a rope handle. The overhead position targets the long head of the triceps in particular. Many lifters save this move for last in their triceps workout, performing it for moderate to high reps, like at least 8-12 reps or higher.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Banded jumping jack",
        "Desc": "The banded jumping jack takes a classic plyometric exercise and adds an extra degree of difficulty in the form of a band surrounding the thighs, just above the knees. It can be performed for time or reps and is a great way to warm up for athletics or lower-body lifting.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Seated Lateral Raise - Gethin Variation",
        "Desc": "The seated dumbbell lateral raiseis an iconic exercise for developing the shoulders. If you’ve ever worked out with weights, chances are you’ve done this move at some point. Proper execution is paramount to avoid injury.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Band good morning-",
        "Desc": "The band good morning is an exercise targeting the hamstrings and glutes. It is often performed in powerlifting-style training for high reps, or in the place of barbell good mornings.",
        "BodyPart": "Lower Back"
    },
    {
        "Title": "Bent Over Barbell Row",
        "Desc": "The barbell bent-over row is a compound exercise used to build strength and size in both the lower and upper back. It targets nearly all of the muscles in the back, but particularly the lats, rhomboids, and lower back. It is commonly utilized as an accessory movement for the deadlift in powerlifting, but is also popular in strength and muscle-focused upper-body workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Medicine ball slam",
        "Desc": "The medicine ball slam is an explosive exercise for developing power, strength, and speed. Muscles worked include the abdominals, legs, triceps, shoulders, and lats. The slams are usually done in rapid succession to complete one set. It can also be a component of a power or athleticism-focused circuit workout.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Seated barbell shoulder press",
        "Desc": "The seated barbell shoulder press is a classic exercise for building muscle and strength in the shoulders. The triceps also play a significant role in pressing the barbell overhead. Performing the movement seated reduces help from the lower body and decreases the risk of overextending the lumbar spine during the movement. This press variation can be the primary pressing movement on an upper-body or shoulder day, or an effective accessory movement later in a workout.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Dip Machine",
        "Desc": "The dip machine is a machine exercise that mimics a triceps dip, a bodyweight exercise performed on parallel bars or on a pull-up and dip station. It targets the triceps first, but also stretches and strengthens the chest and shoulders. Dips with a triceps focus are usually performed with an upright torso, the knees bent and crossed, and the arms close to the body. Dips can be performed for low reps for strength or higher reps for muscle growth.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Standing cable crunch",
        "Desc": "The standing cable crunch is a popular core isolation exercise using a rope attachment. It primarily targets the rectus abdominis or \"six-pack\" muscles, but also strengthens the deep core muscles. It is most commonly performed early in an ab workout, usually in moderate to high reps, such as 8-12 reps per set or higher.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Squat - Gethin Variation",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Rope Lat Pull-down - Gethin Variation",
        "Desc": "The close-grip pull-down is a variation on the lat pull-down, acable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Lying Hamstring Curls - Gethin Variation",
        "Desc": "The lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Bent Over Shoulder Y",
        "Desc": "The lying rear delt Y works the shoulders, specifically the rear heads. The range of motion differs from the lying rear delt fly. At the midpoint, the arms and torso form a Y—hence the name.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "Paul Carter Lat Pull-Down",
        "Desc": "The lat pull-down is a cable-based exercise machine that’s ubiquitous in gyms around the world. This back builder is easy to learn and highly effective, allowing for variable resistance depending on where you place the pin in the stack.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Weighted Push-Up",
        "Desc": "The plate-weighted push-up is a simple way to make a classic bodyweight exercise more difficult. It targets all the same muscles as the push-up: chest, triceps, shoulders, upper back, and core. You can balance a plate on your upper back yourself, but it's easier and safer to have someone else put it there. If you stack a few plates up, be sure to have a spotter close at hand.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Hammer curl",
        "Desc": "The hammer curl is a dumbbell movement that focuses on the biceps, brachialis, and forearm muscles. Throughout each rep, the wrists remain neutral, like a carpenter hammering a nail. It is generally performed for moderate to high reps, such as 8-12 reps or more, as part of the arm-focused portion of a workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Leg Pull-In",
        "Desc": "The reverse crunch is a popular exercise targeting the abdominals, particularly the lower half. It’s easy to perform on either the floor or a flat bench. Many lifters think of this as a companion to the crunch, which targets the upper abdominals more than the lower.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Total Fitness Side Plank",
        "Desc": "The side plank is a popular isometric abdominal exercise focusing on the oblique muscles, as well as the transversus abdominis or deep core muscles. It is sometimes paired with the curl up and bird dog as the “McGill big three” for core strength and stability. It is performed for time and can work in a warm-up or in the core-focused portion of any workout.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "UP Bench Press",
        "Desc": "The bench press is a compound exercise that builds strength and muscle in the chest and triceps. When many people think of listing, the bench press is often the first exercise that comes to mind",
        "BodyPart": "Chest"
    },
    {
        "Title": "Single-Arm Bent-Over Rear Delt Raise - Gethin Variation",
        "Desc": "The single-arm bent-over rear delt fly or rear delt raise is a popular upper-body exercise that targets the muscles on the back of the shoulder joint, specifically the rear head of the deltoid. Since pressing movements build the front and (to a lesser degree) side deltoid heads, this move is often done to promote balanced shoulder development. It is usually performed for high reps, such as 10-15 reps per set or more, as part of a shoulder or upper-body workout.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Svend press",
        "Desc": "The Svend press is an exercise where the chest is targeted by performing presses while squeezing two weight plates together. It is usually performed for relatively high reps with light weights as an accessory movement to the bench press or as a burnout movement on chest day.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Standing side bend stretch",
        "Desc": "The standing side bend stretch is a stretching exercise targeting the obliques, the muscles that run along the side of the core. It is a common inclusion in dynamic warm-ups for the upper body, but can also be performed to help \"limber up\" for lifting or athletics anytime.",
        "BodyPart": "Lats"
    },
    {
        "Title": "L-sit chin-up",
        "Desc": "The L-sit chin-up is an exercise targeting the back, biceps, core, and overall upper-body strength. It is considered significantly more difficult than standard chin-ups, and as such, is often performed for relatively low reps, such as 5-8 reps per set or less, with a focus on strength and form.",
        "BodyPart": "Lats"
    },
    {
        "Title": "FYR Push-Up",
        "Desc": "The push-up is a popular bodyweight exercise that is commonly used in military and tactical physical fitness tests. It’s a classic movement to build upper-body muscle and strength, emphasizing the chest, triceps, and shoulders, but also working the upper back and core.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Speed Box Squat",
        "Desc": "The banded barbell box squat is a strength and power exercise targeting the lower body. It is popular in powerlifting training, either performed with light weights as a power and speed exercise, or heavier for strength. It is usually performed to a box of a height that demands the squatter to decent to around parallel.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Lying hamstring stretch with band",
        "Desc": "The lying hamstring stretch with band is a simple way to stretch a chronically tight muscle group of the lower body. It is common in stretching and yoga classes but can also be performed individually as part of a warm-up, paired with movements in a workout, or as part of a cool-down or recovery strategy.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "UP Quad Extension",
        "Desc": "The leg extension is an isolation exercise for the quads.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Side kick-through push-up",
        "Desc": "The side kick-through push-up is a full-body movement that begins in a bear crawl position and ends with a leg kicked out to the side, with a push-up performed between kick-throughs. It is commonly performed for reps or timed bodyweight circuits and animal-style flows, but can also work on its own or as part of a dynamic warm-up or mobility sequence.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Decline dumbbell fly and press",
        "Desc": "The decline dumbbell fly and press is a dumbbell complex that targets the chest muscles, particularly the lower pecs. By alternating the single-joint fly with the multijoint press, you get the benefits of both and put serious stress on the chest muscles even with relatively light weight. Because the fly will be the limiting factor in weight selection, this pairing is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of upper-body or chest-focused training.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Standing concentration curl",
        "Desc": "The standing concentration curl is a variation on the more common seated concentration curl, which is a staple of bodybuilding arm routines. It can serve as a substitute for preacher curl variations if a preacher bench is unavailable and is also a classic way to focus in on the biceps peak. It is usually performed for moderate to high reps, such as 8-10 reps per set, with a focus on strict form and controlled tempo.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Barbell deadlift bent-over row complex",
        "Desc": "The barbell deadlift bent-over row complex combines two movements to target the posterior chain. It requires using a lighter weight than you could handle for heavy deadlifts alone, but doubles down on activation in the upper back, lower back, and glutes.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Box Jump (Multiple Response)",
        "Desc": "The box jump is a plyometric exercise that strengthens the muscles of the lower body, including the quads, glutes, calves and hamstrings. They also develop power in the lower-body while revving the heart rate.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Cable Overhead Triceps Extension - Gethin Variation",
        "Desc": "The overhead triceps extension is an isolation exercise that is performed with a cable. It is usually performed for moderate to high reps as part of the arm-focused portion of a workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Smith machine bench press",
        "Desc": "The Smith machine bench press is a machine-based movement targeting the chest. The Smith machine mimics a barbell but provides more stability. This movement can be programmed in low reps for strength or higher reps for muscle and strength endurance. It is often performed for moderate to high reps, such as 8-12 reps per set or more, as part of a chest or upper-body focused workout.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Single-arm bench dumbbell row",
        "Desc": "The single-arm bench dumbbell row is a popular exercise for building the latissimus dorsi, or lat, muscles of the back. The bench is used for support during the rowing motion.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Single-arm cable triceps kick-back",
        "Desc": "The single-arm cable triceps kick-back is an isolation exercise that targets the triceps. This is a common burnout move performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "Behind-the-neck pull-down",
        "Desc": "The behind-the-neck pull-down is a cable exercise intended to target the muscles of the upper and middle back. If you have the requisite shoulder mobility, it can help you target the upper back muscles, including the trapezius and rhomboids, as well as the lats (latissimus dorsi). It is popular among elite bodybuilders and physique athletes, but some coaches consider it unsafe to the shoulder joint, particularly for people with existing shoulder problems.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Pushups",
        "Desc": "The push-up is a popular bodyweight exercise that is commonly used in military and tactical physical fitness tests. It’s a classic movement to build upper-body muscle and strength, emphasizing the chest, triceps, and shoulders, but also working the upper back and core.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Cable rope pull-through deadlift",
        "Desc": "The cable rope pull-through deadlift is an exercise targeting the glutes and hamstrings using a proper hip-hinging motion.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Standing reverse-grip cable curl",
        "Desc": "The standing reverse-grip cable curl takes a classic bodybuilding exercise, the reverse barbell curl, and tweaks it by using a handle attached to a cable stack instead. It targets the forearm muscles and brachialis to a greater degree than underhand biceps curl variations. Because grip is a limitation, this move is commonly performed for moderate to high reps, such as 8-12 reps per set or more, as part of an upper-body or arm-focused workout.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Bench crunch",
        "Desc": "The bench crunch is a popular ab exercise performed lying on a bench. It is largely similar to the same exercise performed on the floor, but being able to press the lower back into the bench pad can help reinforce proper form and increase the burn in the abs. Like most crunch variations, it is usually performed for moderate to high reps, such as 8-12 reps per set or more.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Bent-Over Dumbbell Row - Gethin Variation",
        "Desc": "The dumbbell bent-over row is a popular exercise to develop and strengthen the muscles of the upper and middle back, like the latissimus (lat), lower trapezius, and rear deltoids. It can work equally well in strength, muscle-building, or circuit-style fat-loss workouts.",
        "BodyPart": "Lats"
    },
    {
        "Title": "Seated Cable Rows",
        "Desc": "The cable seated row is a popular exercise to train the muscles of the upper back, including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, using a cable stack. It also targets the biceps to a lesser degree. The cable row can work well in a variety of rep-ranges, but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Lying leg curl",
        "Desc": "The lying leg curl is a popular machine-based exercise for the legs, particularly the hamstrings. It is similar to the seated leg curl, but the open hip angle in the lying leg curl may incorporate more glute and calf activation. It is usually performed for moderate to high reps, such as 8-12 reps per set or more, as part of a leg pre-exhaust or as a muscle-building movement for lower-body training.",
        "BodyPart": "Hamstrings"
    },
    {
        "Title": "Smith machine push-up",
        "Desc": "The Smith machine push-up is an upper-body exercise targeting the chest, shoulders, and triceps. It is similar in form to bodyweight push-ups, but with the hands on the bar of the Smith machine. This allows you to vary the height to increase or decrease difficulty, or to perform a mechanical dropset by raising the bar after hitting failure at a certain height.",
        "BodyPart": "Chest"
    },
    {
        "Title": "Single-arm dumbbell racked carry",
        "Desc": "The single-arm dumbbell racked carry involves carrying a single dumbbell for time or distance, while holding it close to the shoulders in a front-racked position. Similar to a dumbbell farmer's carry, it can be a challenging finisher to any workout, or work well in fat-loss circuit training or as an accessory movement to heavy lifts like the deadlift.",
        "BodyPart": "Shoulders"
    },
    {
        "Title": "FYR Alternating Lunge",
        "Desc": "The forward lunge is a lower-body bodyweight exercise targeting the quads, glutes, and hamstrings. It can also be performed holding dumbbells or other weights. The forward lunge places more emphasis on the quads than other lunge variations. It can be performed for time or reps in the lower-body portion of any workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "FYR Progressive High Knee",
        "Desc": "High knees is a full-body, cardio-based exercise with an emphasis on the lower body. It is often performed for reps or time as part of a dynamic warm-up.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "One-Arm Dumbbell Row",
        "Desc": "The single-arm bench dumbbell row is a popular exercise for building the latissimus dorsi, or lat, muscles of the back. The bench is used for support during the rowing motion.",
        "BodyPart": "Middle Back"
    },
    {
        "Title": "Alternating incline dumbbell biceps curl",
        "Desc": "The alternating incline dumbbell biceps curl is an exercise targeting the biceps and performed face up on an incline bench. This creates a vertical arm angle which helps to isolate the biceps and limit involvement of the shoulder muscles. This curl variation is usually performed for moderate to high reps, such as 8-12 rep per arm or more, as part of upper-body or arm-focused training.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Scissors Jump",
        "Desc": "The alternating lunge jump is an explosive bodyweight exercise that targets the lower-body muscles, including the quads, glutes, and hamstrings. It can be performed for time or reps in power training, and is also effective in any fat-loss or athleticism-focused workout.",
        "BodyPart": "Quadriceps"
    },
    {
        "Title": "Sit-Up - Gethin Variation",
        "Desc": "The sit-up is a popular bodyweight exercise focused on the abdominal muscles. It has also been used as part of military, tactical, and scholastic fitness tests for many years. It can be performed for time or reps, with the feet anchored or free, on flat ground or a bench.",
        "BodyPart": "Abdominals"
    },
    {
        "Title": "Kettlebell thruster",
        "Desc": "The kettlebell thruster is a popular kettlebell movement that combines a kettlebell front squat with a kettlebell press, while holding the bell in a goblet or bottoms-up grip. It is preceded by a clean at the start of each set, and you can perform a clean between each rep if you choose. It can be trained in traditional strength or muscle-building rep ranges, in circuit or fat-loss training, or as part of a larger kettlebell combination or complex.",
        "BodyPart": "Glutes"
    },
    {
        "Title": "Seated wide-grip curl to close-grip curl",
        "Desc": "The seated wide-grip curl to close-grip curl is a variation on the classic seated dumbbell curl. It is thought that wide-grip curls target the inner head of the biceps more, while close-grip curls target the outer head or peak. This variation allows you to get the benefits of both.",
        "BodyPart": "Biceps"
    },
    {
        "Title": "Kneeling Cable Triceps Extension - Gethin Variation",
        "Desc": "The kneeling cable triceps extension is an single-joint exercise meant to isolate the triceps muscles, using a high pully on a cable stack and a bench. It can also be performed in a tall-kneeling stance from a low pully. It is most commonly used in muscle-building triceps or overall arms workouts.",
        "BodyPart": "Triceps"
    },
    {
        "Title": "AM Barbell Squat",
        "Desc": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
        "BodyPart": "Quadriceps"
    }
]